const countries = [{
    countryEng: "Abkhazia",
    countryName: "Абхазия",
    countryRegion: ['Сухум', 'Гагра', 'Гудаута', 'Гали', 'Очамчира', 'Ткуарчал', 'Гали', ]
},
{
    countryEng: "Australia",
    countryName: "Австралия",
    countryRegion: ['Сидней', 'Мельбурн', 'Брисбен', 'Аделаида', 'Голд-Кост', 'Ньюкасл', 'Канберра', 'Вуллонгонг', 'Саншайн-Кост', 'Хобарт', 'Лейк-Маккуори', 'Джелонг', 'Таунсвилл', 'Ипсуич', 'Госфорд', 'Кэрнс', 'Тувумба', 'Дарвин', 'Лонсестон', ]
},
{
    countryEng: "Austria",
    countryName: "Австрия",
    countryRegion: ['Вена', 'Грац', 'Линц', 'Зальцбург', 'Инсбрук', 'Клагенфурт	', 'Вельс	', 'Филлах', 'Санкт-Пёльтен	', 'Дорнбирн', 'Винер-Нойштадт	', 'Штайр', 'Фельдкирх', 'Брегенц', 'Вольфсберг', 'Баден', 'Леобен', 'Клостернойбург', 'Траун', 'Кремс', ]
},
{
    countryEng: "Azerbaijan",
    countryName: "Азербайджан",
    countryRegion: ['Баку', 'Гянджа', 'Сумгайыт', 'Мингечевир', 'Хырдалан', 'Ленкорань', 'Ширван', 'Нахичевань', 'Шеки', 'Хачмаз', 'Евлах', 'Джалилабад', 'Агджабеди', 'Шамкир', 'Губа', 'Барда', 'Шемаха', 'Салян', 'Геокчай', 'Имишли', ]
},
{
    countryEng: "Albania",
    countryName: "Албания",
    countryRegion: ['Тирана', 'Эльбасан', 'Дуррес', 'Шкодер', 'Влёра', 'Корча', 'Фиери', 'Кучова', 'Саранда', 'Берат', 'Кавая', 'Люшня', 'Поградец', 'Гирокастра', 'Камез', 'Круя', 'Лежа', 'Буррели', 'Кукес', 'Чоровода', ]
},
{
    countryEng: "Algeria",
    countryName: "Алжир",
    countryRegion: ['Адрар', 'Алжир', 'Аннаба', 'Аян-Дафлах', 'Батна', 'Бешар', 'Биджая', 'Бискра', 'Блида', 'Бордж-Бу-Арреридж', 'Буйра', 'Бумердес', 'Джельфа', 'Константина', 'Лагуат', 'Маскара', 'Медеа', 'Мостаганем', 'Оран', 'Саида', 'Тамангассет', 'Тиарет', 'Тизи-Узу', 'Типаса', 'Уаргла', 'Эш-Шелифф', ]
},
{
    countryEng: "Angola",
    countryName: "Ангола",
    countryRegion: ['Бенгела', 'Бенго', 'Бие', 'Заире', 'Кабинда', 'Квандо-Кубанго', 'Кунене', 'Луанда', 'Маланже', 'Мошико', 'Намибе', 'Северная Кванза', 'Северная Лунда', 'Уамбо', 'Уиже', 'Уила', 'Южная Кванза', 'Южная Лунда', 'Лубанго', 'Куито', 'Лобиту', 'Луено', 'Сауримо', 'Сойо', 'Сумбе', 'Каала', 'Кубал', 'Дундо', 'Негаге', 'Матала', ]
},
{
    countryEng: "Andorra",
    countryName: "Андорра",
    countryRegion: ['Андорра-ла-Велья', 'Канильо', 'Ла-Массана', 'Ордино', 'Сант-Жулия-де-Лория', 'Энкамп', 'Эскальдес-Энгордань', 'Округ святого Павла', 'Округ святого Петра', 'Округ святого Филиппа', ]
},
{
    countryEng: "Antigua and Barbuda",
    countryName: "Антигуа и Барбуда",
    countryRegion: ['Барбуда', 'Округ Девы Марии', 'Округ святого Георгия', 'Округ святого Иоанна', 'Сент-Джонс', 'Либерта', 'Гончарная деревня', 'Боланс', 'Пиготс', 'Кодрингтон', 'Пархем', 'Всех Святых']
},
{
    countryEng: "Argentina",
    countryName: "Аргентина",
    countryRegion: ['Буэнос-Айрес провинция', 'Буэнос-Айрес Федеральная столица', 'Жужуй', 'Катамарка', 'Кордова', 'Корриентес', 'Ла-Пампа', 'Ла-Риоха', 'Мендоса', 'Мисьонес', 'Неукен', 'Огненная Земля, Антарктида и острова Южной Атлантики', 'Рио-Негро', 'Сальта', 'Сан-Луис', 'Санта-Крус', 'Санта-Фе', 'Сантьяго-дель-Эстеро', 'Сан-Хуан', 'Тукуман', 'Формоса', 'Чако', 'Чубут', 'Энтре-Риос']
},
{
    countryEng: "Armenia",
    countryName: "Армения",
    countryRegion: ['Арагацотн', 'Арарат', 'Армавир', 'Вайоц Дзор', 'Гехаркуник', 'Ереван', 'Котайк', 'Лори', 'Сюник', 'Тавуш', 'Ширак']
},
{
    countryEng: "Aruba",
    countryName: "Аруба",
    countryRegion: ['Ноорд', 'Восточный Ораньестад', 'Западный Ораньестад', 'Парадера', 'Северный Сант-Николас', 'Южный Сант-Николас', 'Санта-Крус', 'Саванета']
},
{
    countryEng: "Afghanistan",
    countryName: "Афганистан",
    countryRegion: ['Баглан', 'Бадахшан', 'Бадгис', 'Балх', 'Бамиан', 'Вардак', 'Газни', 'Герат', 'Гильменд', 'Гор', 'Дайкунди', 'Джаузджан', 'Забуль', 'Кабул', 'Кандагар', 'Каписа', 'Кунар', 'Пактия', 'Тахар', 'урузган', 'Фарах', 'Фарьяб']
},
{
    countryEng: "Bahamas",
    countryName: "Багамы",
    countryRegion: ['Фритаун', 'Вест-Энд', 'Куперс-Таун', 'Андрос Таун', 'Кларенс-Таун', 'Данмор-Таун', 'Рок-Саунд', 'Город Артура', 'Фрипорт', 'Харбор', 'Эксума', 'Кокберн Таун', 'Джорджтаун', 'Алис-Таун', 'Свитинг-Кей', 'Мэтью Таун']
},
{
    countryEng: "Bangladesh",
    countryName: "Бангладеш",
    countryRegion: ['Барисалская область', 'Даккаская область', 'Кхулнаская область', 'Раджшахская область', 'Раджшахская область', 'Рангпурская область', 'Силхетская область', 'Читтагонг', 'Тонги', 'Богра', 'Маймансингх', 'Савар', 'Комилла', 'Нараянга́ндж', 'Джессор', 'Гизапур', 'Брахманбария', 'Динаджпур', 'Нарсингди', 'Навабгандж', 'Чандпур', 'Тангайл']
},
{
    countryEng: "Barbados",
    countryName: "Барбадос",
    countryRegion: ['Приход святого Андрея', 'Приход святого Георгия', 'Приход святого Джона', 'Приход святого Иакова', 'Приход святого Иосифа', 'Приход святого Люсии', 'Приход святого Михаила', 'Приход святого Петра', 'Приход святого Филиппа', 'Приход Цервки Христа']
},
{
    countryEng: "Bahrain",
    countryName: "Бахрейн",
    countryRegion: ['Мухаррак', 'Столичное губернаторство', 'Центральное губернаторство', 'Южное губернаторство', 'Манама', 'Эр-рифа', 'Мадинат-Хамад', 'Авали', 'Мадинат-Иса', 'Ситра', 'Эль-Будайи']
},
{
    countryEng: "Belarus",
    countryName: "Беларусь",
    countryRegion: ['Брестская область', 'Витебская область', 'Гомельская область', 'Гродненская область', 'Минская область', 'Могилёвская область', 'Гродно', 'Бобру́йск', 'Бара́новичи', 'Бори́сов', 'Пинск', 'Орша', 'Мозырь', 'Солигорск', 'Новополоцк']
},
{
    countryEng: "Belize",
    countryName: "Белиз",
    countryRegion: ['Белиз', 'Корозал', 'Орандж-Уолк', 'Сан-Игнасио', 'Бельмопа́н', 'Сан-Педро', 'Дангри́га', 'Бенке-Вьехо-дель-Кармен', 'Пунта-Горда']
},
{
    countryEng: "Belgium",
    countryName: "Бельгия",
    countryRegion: ['Алст', 'Анген', 'Анден', 'Анню', 'Антве́рпен', 'Антуан', 'Арлон', 'Арсхот', 'Ат', 'Ауденарде', 'Адунберг', 'Бастонь', 'Беринген', 'Билзен', 'Бенш', 'Бланкенберге', 'Бомон', 'Борглон', 'Борен', 'Бре', 'Брен-ле-Ко́нт', 'Брюгге', 'Брюссе́ль', 'Буйон', 'Вавр', 'Вальку́р', 'Варегам', 'Варем', 'Вервик', 'Вервье', 'Визе', 'Вилворде', 'Виртон', 'Гел', 'Генк', 'Гент', 'Герардсберген', 'Гистел', 'Дамме', 'Дейнзе', 'Дендермонде', 'Диксмёйде', 'Динан', 'Дист', 'Дюрбюи́', 'Женап', 'Жамблу', 'Жодаунь', 'Зоттегем', 'Изегем', 'Ипр', 'Коми́н-Варнето́н', 'Кортрейк', 'Кувен', 'Ла-Лувьер', 'Ла-Рош-ан-Арде́н', 'Ленник', 'Ле-Рё', 'Лессин', 'Лёвен', 'Лёз-ан-Эно́', 'Лембур', 'Лир', 'Локерен', 'Ломмел', 'Льеж', 'Маасейк', 'Мальмеди́', 'Марш-ан-Фаме́н', 'Месен', 'Мехелен', 'Монс', 'Мускрон', 'Намюр', 'Нёшато', 'Нивель', 'Ниновое', 'Ньивпорт', 'Остенде', 'Оттиньи-Лувен-ла-Нё́в', 'Пер', 'Перюве́льз', 'Ронсе', 'Рошфор', 'Ру́селаре', 'Сен-Вит', 'Сен-Гиле́н', 'Сент-Юбе́р', 'Серен', 'Сине', 'Синт-Ни́клас', 'Синт-Трёйден', 'Спа', 'Ставло', 'Суаньи́', 'Тинен', 'Тонгерен', 'Торхаут', 'Турне', 'Тю́рнхаут', 'Тюен', 'Уффализ', 'Филиппви́ль', 'Флёрюс', 'Флоранви́ль', 'Фонтен-л’Эвек ', 'Фос-ла-Ви́ль', 'Хален', 'Халле', 'Хамонт-Ахел', 'Харелбеке', 'Ха́сселт', 'Херенталс', 'Шарлеруа́', 'Шатле', 'Шиме', 'Шбевр', 'Экло', 'Эйпен', 'Эрв', 'Эрсталь', 'Юи']
},
{
    countryEng: "Benin",
    countryName: "Бенин",
    countryRegion: ['Абоме́й', 'Абомей-Калави', 'Аллада', 'Аплауэ', 'Джугу', 'Догбо-Тота', 'Ганвье', 'Бори', 'Гран-Поло', 'Канди', 'Керу', 'Кету', 'Кове', 'Коме', 'Котону', 'Куанде', 'Локосса', 'Натити́нгу', 'Ндали', 'Никки', 'Параку', 'Порга', 'Порто-Ново', 'Уида', 'Боикон', 'Саве']
},
{
    countryEng: "Bermuda",
    countryName: "Бермудские острова",
    countryRegion: ['Центральные регионы Бермуд', 'Округ Уорик', 'Округ Пейджет', 'Округ Пембрук', 'Округ Девоншир', 'Округ Смит', 'Муниципалитет Гамильтон']
},
{
    countryEng: "Bulgaria",
    countryName: "Болгария",
    countryRegion: ['Благоевградская область', 'Бургасская область', 'Варненская область', 'Габровская область', 'Добричская область', 'Кюстендилская область', 'Ловечская область', 'Монтанская область', 'Разградская область', 'Силистренская область', 'Сливенская область', 'Тырговиштская область', 'Хасковская область', 'Шуменская область', 'Ямболская область']
},
{
    countryEng: "Bolivia",
    countryName: "Боливия",
    countryRegion: ['Асенсион-де-Гуарайос', 'Эль-Альто', 'Ла-Пас', 'Кочабамба', 'Оруро', 'Сукре', 'Тариха', 'Чукисака', 'Потоси', 'Сакаба', 'Кийаколло', 'Монтеро', 'Триндад', 'Риберальта', 'Варнес', 'Ла-Гуардия', 'Виача', 'Якубиа', 'Колкапирхуа', 'Тикипия', 'Кобиджа', 'Винто', 'Гуаярамерин', 'Вильясон', 'Япакани', 'Вильямонтес', 'Бермежо', 'Камири', 'Тупиза', 'Ллаллагуа', ]
},
{
    countryEng: "Bosnia and Herzegovina",
    countryName: "Босния и Герцеговина",
    countryRegion: ['Брчко', 'Республика Сербская', 'Федерация Боснии и Герцеговины', 'Сара́ево', 'Ба́ня-Лу́ка', 'Тузла', 'Зе́ница', 'Мостар', 'Биелина', 'Бихач', 'Приедор', 'Добой', 'Тре́бине', 'Сански-Мост', 'Живинице', 'Бугойно', 'Тра́вник', 'Гради́шка', 'Цазин', 'Община Исто́чно-Сара́ево', 'Пале', 'Градачац ', 'Грачаница', 'Дервента', 'Зво́рник', 'Горажде', 'Лукавац ', 'Фоча', 'Козарска-Дубица', 'Високо', ]
},
{
    countryEng: "Botswana",
    countryName: "Ботсвана",
    countryRegion: ['Габоро́не', 'Франсиста́ун', 'Молеполо́ле', 'Могодича́не', 'Маун', 'Селе́би-Пхи́кве', 'Серове', 'Канье', 'Мочуди', 'Махала́пье', 'Тлоквенг ', 'Пала́пье', 'Лобаце', 'Рамоцва', 'Летлхакане', 'Тоното', 'Мошупа', 'Тамага', 'Джваненг', 'Бобононг']
},
{
    countryEng: "Brazil",
    countryName: "Бразилия",
    countryRegion: ['Ананиндеуа', 'Алагоас', 'Амазонас', 'Амапа', 'Баия', 'Гояс', 'Мараньян', 'Мату-Гросу', 'Мату-Гросу-ду-Сул', 'минас-Жерайс', 'ара', 'Параиба', 'Парана', 'Пернамбуку', 'Рио-де-Жанейро', 'Риу-Гранди-ду-Норти', 'Риу-Гранди-ду-Сул', 'Сан-Паулу', 'Сеара', 'Сержипи', 'Токантинс', 'Федеральный округ', 'Эспириту-Санту', 'Брази́лиа', 'Салвадо́р', 'Фортале́за', 'Мана́ус', 'Курити́ба', 'Реси́фи ', 'По́рту-Але́гри', ]
},
{
    countryEng: "Brunei",
    countryName: "Бруней",
    countryRegion: ['Бруней-Муара', ' Бруней-Даруссаламе', 'Куала-Белайт', 'Ба́ндар-Сери́-Бега́ван', 'Сериа', 'Джерудонг']
},
{
    countryEng: "Burkina Faso",
    countryName: "Буркина Фасо",
    countryRegion: ['Уагаду́гу', 'Банфо́ра', 'Бо́бо-Диула́со', 'tКуду́гу', 'Банфора', 'Вахигуя', 'Пуйтенга', 'Кая', 'Тенкодого', 'Фада-Нгурма', 'Дедугу', 'Гаранго ', 'Джибо', 'Купела', 'Рео', 'Лео', 'Конгуси', 'Гава', 'Гурси', 'По', 'Комбисири', 'Яко', 'Ньянголоко', 'Дори', 'Ородара', 'Зорго', 'Манга', 'Титао', 'Нуна', 'Туган', 'Булса', 'Зиниари']
},
{
    countryEng: "Burundi",
    countryName: "Бурунди",
    countryRegion: ['Бубанза', 'Бужумбура', 'Бурури', 'Гитега', 'Кайанза', 'Канкузо', 'Кирундо', 'Макамба', 'Муйинга', 'Нгози', 'Руйиги', 'Рутана']
},
{
    countryEng: "Butane",
    countryName: "Бутан",
    countryRegion: ['Бумтанг', 'Вангди-Пходранг', 'Дагана', 'Лхунце', 'Монгар', 'Паро', 'Пемагатшел', 'Самце', 'Сандруп Джонкар', 'Ташиганг', 'Тонгса', 'Тхимпху', 'Хаа', 'Циранг', 'Чжемганг', 'Чукха']
},
{
    countryEng: "Vanuatu",
    countryName: "Вануату",
    countryRegion: ['Малампа', 'Пенама', 'Санма', 'Тафеа', 'Шефа', 'Порт-Ви́ла', 'Люганвиль', 'Порт Олри']
},
{
    countryEng: "Vatican",
    countryName: "Ватикан",
    countryRegion: ['Ватикан']
},
{
    countryEng: "Great Britain",
    countryName: "Великобритания",
    countryRegion: ['Англия', 'Гернси', 'Гибралтар', 'Мэн', 'Острова Питкерн', 'Северная Ирландия', 'Уэльс', 'Шотландия', 'Южная Георгия и Южные Сандвичевы острова']
},
{
    countryEng: "Hungary",
    countryName: "Венгрия",
    countryRegion: ['Баранья', 'Бач-Кишкун', 'Бекеш', 'Боршод-Абауй-Земплен', 'Будапешт', 'Ваш', 'Веспрем', 'Дьёр-Мошон-Шопрон', 'Зала', 'Комаром-Эстергом', 'Ноград', 'Пешт', 'Сабольч-Сатмар-Берег', 'Тольна', 'Фейер', 'Хайду-Бихар', 'Хевеш', 'Чонград', 'Шомодь', 'Яс-Надькун-Сольнок']
},
{
    countryEng: "Venezuela",
    countryName: "Венесуэла",
    countryRegion: ['Кааракас', 'Марака́йбо', 'Вале́нсия', 'Баркисиме́то', 'Сьюдад-Гуаяна', 'Барсело́на', 'Сьюда́д-Боли́вар', 'Турме́ро', 'Сан-Кристобаль', 'Бари́нас', 'Кабимас', 'Пуэ́рто-ла-Крус', 'Мерида', 'Гуаренес', 'Коро', 'Гуакара', 'Акаригуа', 'Кабударе', 'Валера', 'Карупано', 'Кагуа', 'Федеральное владение Венесуэлы', 'Федеральный округ Венесуэлы', 'Яракуй']
},
{
    countryEng: "Vietnam",
    countryName: "Вьетнам",
    countryRegion: ['Анзянг', 'Бакльеу', 'Бариа-Вунгтау', 'Бенче', 'Биньдинь', 'Биньтхуан', 'Виньлонг', 'Даклак', 'Дананг', 'Донгнай', 'Зялай', 'Йенбай', 'Камау', 'Кантхо', 'Намдинь', 'Тхайнгуен', 'Тханьхоа', 'Тхыатхьен-Хюэ', 'Фуйен', 'Хайзыонг', 'Хайфон', 'Шокчанг', 'Шонла']
},
{
    countryEng: "Gabon",
    countryName: "Габон",
    countryRegion: ['Либреви́ль', 'Порт-Жантиль', 'Франсви́ль', 'Оем', 'Моандо', 'Муила', 'Ламбарене', 'Чибанга', 'Куламуту', 'Макоку', 'Битам', 'Тсогни', 'Гамба', 'Мунана', 'Нтум', 'Нкан', 'Ластурвиль', 'Оконджа', 'Нденде', 'Буе', 'Фугаму', 'Нджоле', 'Мбигу', 'Маюмба', 'митзик', 'Мекамбо', 'Лекони', 'Мимонго', 'Минвул', 'Омбуе']
},
{
    countryEng: "Hawaiian Islands",
    countryName: "Гавайские острова",
    countryRegion: ['test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test', ]
},
{
    countryEng: "Guyana",
    countryName: "Гайана",
    countryRegion: ['Барима-Ваини', 'Верхний Демерара-Бербайс', 'Верхний Такуту-Верхний Эссекуибо', 'Восточный Бербайс-Корентин', 'Демерара-Махаиса', 'Куйуни-Мазаруни', 'Махаика-Бербайс', 'Острова Эссекуибо-Западная Демерара', 'Померун-Супенаам', 'Потаро-Сипаруни']
},
{
    countryEng: "Haiti",
    countryName: "Гаити",
    countryRegion: ['Порт-о-Пренс', 'Карфур', 'Дельма', 'Петьонвиль', 'Гонаи́в', 'Сите-Солей', 'Кап-Аитье́н', 'Сен-Марк', 'Куа-де-Буке', 'Леоган', 'Пор-де-Пе']
},
{
    countryEng: "Gambia",
    countryName: "Гамбия",
    countryRegion: ['Банжул', 'Серекунда', 'Брикама', 'Бакау', 'Ламин']
},
{
    countryEng: "Ghana",
    countryName: "Гана",
    countryRegion: ['А́ккра', 'Кумаси', 'Тамале', 'Ашаиман', 'Се́конди-Такора́ди', 'Кейп-Кост', 'Обуа́си', 'Теши', 'Тема', 'Мадина', 'Кофоридуа', 'Ва', 'Течиман', 'Хо', 'Сунья́ни']
},
{
    countryEng: "Guadeloupe",
    countryName: "Гваделупа",
    countryRegion: ['Анс-Бертран', 'Бэ-Махо', 'Байлиф', 'Басс-Терр', 'Буйанте', 'Капстер-Belle-Eau', 'Деэ', 'Ла Дезирад', 'Ле Гозье', 'Ле Гозье', 'Гранд-Бур', 'Ламентин', 'Морн-а-лО', 'Ле Муль', 'Лез Абимес', 'Пуэнт-а-Питр', 'Пуэнт-Нуар', 'Порт-Луи, Гваделупа', 'Сен-Клод', 'Сен-Франсуа', 'Сен-Луи', 'Сент-Анн', 'Сент-Роуз', 'Teррe-де-Ба']
},
{
    countryEng: "Guatemala",
    countryName: "Гватемала",
    countryRegion: ['Альта-Верапас', 'Баха-Верапас', 'Гватемала', 'Реталулеу', 'Сучитепекес', 'Тотоникапан', 'Уэуэтенанго', 'Халапа', 'Хутьяпа', 'Чикимула', 'Чимальтенанго', 'Эль-Прогресо', 'Эскуинтла']
},
{
    countryEng: "Guinea",
    countryName: "Гвинея",
    countryRegion: ['Киндия', 'Конакри', 'Лабе', 'Нзерекоре', 'Боке', 'Канкан', 'Кисиду́гу', 'Фарана', 'Фриа']
},
{
    countryEng: "Guinea-Bissau",
    countryName: "Гвинея-Бисау",
    countryRegion: ['Бисау', 'Бафата', 'Габу', 'Бисорон', 'Болама', 'Кашеу']
},
{
    countryEng: "Germany",
    countryName: "Германия",
    countryRegion: ['Мю́нхен', 'Баден-Вюртемберг', 'Берлин', 'Бранденбург', 'Бремен', 'Гамбург', 'Гессен', 'Мекленбург-Передняя Померания', 'Нижняя Саксония', 'Рейнланд-Пфальц', 'Саар', 'Саксония', 'Саксония-Анхальт', 'Северный Рейн-Вестфалия', 'Тюрингия', 'Шлезвиг-Гольштейн', 'Кёльн', 'Шту́тгарт', 'Фра́нкфурт-на-Ма́йне', 'Дю́ссельдорф', 'До́ртмунд', 'Эссен', 'Лейпциг', 'Ганно́вер', 'Нюрнберг', 'Ду́йсбург ', 'Бохум', 'Вупперталь', 'Бонн', 'Аугсбург', ]
},
{
    countryEng: "Honduras",
    countryName: "Гондурас",
    countryRegion: ['Атлантида', 'Валле', 'Грасьяс-а-Дьос', 'Интибука', 'Ислас-де-ла-Баия', 'Йоро', 'Окатепеке', 'Оланхо', 'Санта-Барбара', 'Франсиско-Морасан', 'Чолутека', 'Эль-Параисо', 'Колон', 'Кортес', 'Йоро', 'Оланчо']
},
{
    countryEng: "Hong Kong",
    countryName: "Гонконг",
    countryRegion: ['Абердин', 'Чунг Чау', 'Дисковер бай', 'Ха Цуэн', 'Еам Тин', 'Куан Тонг', 'Кву Тунг', 'Лау Фау Шань', 'Лэй Юэ Мун', 'Луен Во Хуэй', 'Ма Ван', 'Муи во', 'Пинг Шань', 'Пен Чау', 'Сай Кунг', 'Сан Тин', 'ШаТау Кок', 'Шам Ценг', 'Шек О', 'Сок Кву Ван', 'Стенли', 'Тай О', 'Юэнь Лонг Таун', 'Юнг Шу Ван']
},
{
    countryEng: "Grenada",
    countryName: "Гренада",
    countryRegion: ['Округ святого Андрея', 'Округ святого Георгия', 'Округ святого Давида', 'Округ святого Иоанна', 'Округ святого Марка', 'Округ святого Патрика', 'Эмбер Белэр', 'Баколет', 'Барике', 'Бек Муи', 'Бельмонт', 'Боглес', 'Буа-де-Ганнес', 'Каливиньи', 'Шантимель', 'Чутц ', 'Клабони', 'Крошу', 'Дебландо', 'Диего Пис', 'Эли Холл', 'Гуйаве', 'Гранд Рой', 'Гренвилл', 'Хиллсборо', 'Ка-фе Бо', 'Мама Канны', 'Молти', 'Морн Фендю', 'Морн-Джалу-Ридж', ]
},
{
    countryEng: "Greece",
    countryName: "Греция",
    countryRegion: ['Ахайя', 'Этолия', 'Акарнания', 'Афины', 'Салоники', 'Патры', 'Ираклион', 'Лариса', 'Волос', 'Ахарне', 'Ханья', 'Янина', 'Халкида', 'Трикала', 'Агринион', 'Катерини', 'Каламата', 'Серре', 'Александруполис', 'Ксанти', 'Кавала', 'Ламия', 'Комотони', 'Родос', 'Драма', 'Верия', 'Козани', 'Керкира', 'Кардица', 'Саламин', 'Ретимнон', 'Хиос', 'Ано-Льосия', 'Птолемаис', 'Триполис', 'Аспро́пиргос', 'Коринф', 'Яница', 'Митилини', 'Эйон', 'Элефсис', 'Пиргос', 'Мегара', 'Килкис', 'Фивы', 'аргос', 'Арта', 'Луца', 'Левадия', 'Кос', 'Ореокастрон', 'Короли', 'Преваза', 'Спарта', 'Науса', 'Перея', 'Орестиас', 'Эдеса', 'Флорина', 'Амальяс', 'Палини', 'Терми', 'Эрмуполис', 'Неа-Макри', 'Александрия', 'Пеания', 'Каливия-Торику']
},
{
    countryEng: "Georgia",
    countryName: "Грузия",
    countryRegion: ['Автономная Республика Аджария', 'Гурия', 'Имеретия', 'Кахетия', 'Квемо-Картли', 'Мцхета-Мтианети', 'Рача-Лечхуми и Квемо-Сванети', 'Самегрело и Земо-Сванети', 'Самцхе-Джавахетия', 'Тбилиси', 'Шида-Картли']
},
{
    countryEng: "Denmark",
    countryName: "Дания",
    countryRegion: ['Зеландия', 'Северная Ютландия', 'Столичная область', 'Центральная Ютландия', 'Южная Дания', 'Копенга́ген', 'Орхус', 'Оденсе', 'Ольборг', 'Эсбьерг']
},
{
    countryEng: "Djibouti",
    countryName: "Джибути",
    countryRegion: ['Али-Сабье', 'Арта', 'Джибути', 'Дихил', 'Обок', 'Таджурах']
},
{
    countryEng: "Dominica",
    countryName: "Доминика",
    countryRegion: ['Округ святого Андрея', 'Округ Святого Георгия', 'Округ Святого Давида', 'Округ святого Иоанна', 'Округ Святого Иосифа', 'Округ Святого Петра', 'Округ Святого Патрика', 'Округ святого Павла', 'Округ святого Марка']
},
{
    countryEng: "Dominican Republic",
    countryName: "Доминикана",
    contys: ['Округ святого Андрея', 'Округ Святого Георгия', 'Округ Святого Давида', 'Округ святого Иоанна', 'Округ Святого Иосифа', 'Округ святого Марка', 'Округ святого Павла', 'Округ Святого Патрика', 'Округ Святого Петра']
},
{
    countryEng: "Guatemala",
    countryName: "Гватемала",
    countryRegion: ['Гватемала', 'Департамент Кецальтенанго', 'Департамент Эскуинтла', 'Департамент Эскуинтла', 'Департамент Чимальтенанго', 'Департамент Уэуэтенанго', 'Изабальский отдел', 'Департамент Альта Верапас', 'Департамент Киче', 'Департамент Тотоникапан', 'Департамент Сучитепекес', 'Халапа', 'Чикимула Департамент', 'Департамент Реталулеу', 'Департамент Сакатепекес', 'Департамент Сан-Маркос', 'Департамент Солола', 'Департамент Закапа', 'Департамент Уэуэтенанго', 'Департамент Кецальтенанго', 'Департамент Баха Верапас', 'Департамент Чимальтенанго', 'Петен']
},
{
    countryEng: "Egypt",
    countryName: "Египет",
    countryRegion: ['Александрия', 'Асуан', 'Асьют', 'Бени-Суэйф', 'Бухейра', 'Гарбия', 'Гиза', 'акахлия', 'Думьят', 'Исмаилия', 'Матрух', 'Минуфия', 'Новая Долина', 'Порт-Саид', 'Северный Синай', 'Сохаг', 'Суэц', 'Хелуан', 'Эль-Файюм', 'Южный Синай']
},
{
    countryEng: "Zambia",
    countryName: "Замбия",
    countryRegion: ['Восточная провинция', 'Западная провинция', 'Луапула', 'Лусака', 'Медный пояс', 'Северная провинция', 'Северо-Западная провинция', 'Южная провинция', 'Коппербелт']
},
{
    countryEng: "Zimbabwe",
    countryName: "Зимбабве",
    countryRegion: ['Булавайо', 'Восточный Машоналенд', 'Западный Машоналенд', 'Масвинго', 'Мидлендс', 'Северный Матабелеленд', 'Хараре', 'Центральный Машоналенд', 'Южный Матабелеленд', 'Маникаленд']
},
{
    countryEng: "Israel",
    countryName: "Израиль",
    countryRegion: ['Западный берег реки Иордан', 'Тель-Авивский округ', 'Иудея и Самария', 'Северный округ', 'Иерусалимский округ', 'ель-Авивский округ', 'Хайфский округ', 'Центральный округ', 'Южный округ']
},
{
    countryEng: "Indonesia",
    countryName: "Индонезия",
    countryRegion: ['Джакарта', 'Восточная Ява', 'Западная Ява', 'Северная Суматра', 'Бантен', 'Центральная Ява', 'Южная Суматра', 'Южный Сулавеси', 'Кепулауан-Риау', 'Риау', 'Лампунг', 'Западная Суматра', 'Бали', 'Восточный Калимантан', 'Южный Калимантан', 'Западный Калимантан', 'Джамби', 'Западная Нуса-Тенгара', 'Северный Сулавеси', 'Джокьякарта', 'Центральный Сулавеси', 'Малуку', 'Северный Калимантан', 'Бенкулу', 'Юго-Восточный Сулавеси', 'Папуа', 'Ачех', 'Горонтало', 'Банка-Белитунг', 'Западное Папуа', ]
},
{
    countryEng: "Jordan",
    countryName: "Иордания",
    countryRegion: ['Аджлун', 'Амман', 'Акаба', 'Джараш', 'Ирбид', 'Маан', 'Мадаба', 'Эз-Зарка', 'Эль-Балка', 'Эль-Карак', 'Эт-Тафила', 'Эль-Мафрак']
},
{
    countryEng: "Iraq",
    countryName: "Ирак",
    countryRegion: ['Анбар', 'Бабиль', 'Багдад', 'Басра', 'Васит', 'Дахук', 'Ди-кар', 'Дияла', 'Кадисия', 'Кербела', 'Киркук', 'Майсан', 'Мутана', 'Наджаы', 'Найнава', 'Салах-эд-Дин', 'Сулеймания', 'Эрбиль']
},
{
    countryEng: "Iran",
    countryName: "Иран",
    countryRegion: ['Провинция Альборз', 'Провинция Ардебиль', 'Провинция Бушер', 'Провинция Чахармахал и Бахтиари', 'Провинция Восточный Азербайджан', 'Провинция Исфахан', 'Провинция Фарс', 'Провинция Гилян', 'Провинция Голестан', 'Провинция Хамадан', 'Провинция Хормозган', 'Провинция Илам', 'Керман Провинция', 'Провинция Керманшах', 'Провинция Хузестан', 'Кохгилуе и провинция Бойер-Ахмад', 'Курдистан', 'Провинция Лорестан', 'Провинция Маркази', 'Провинция Мазандаран', 'Провинция Северный Хорасан', 'Провинция Казвин', 'Провинция Кум', 'Провинция Разави-Хорасан', 'Провинция Семнан', 'Провинция Систан и Белуджистан', 'Провинция Южный Хорасан', 'Тегеранская провинция', 'Провинция Западный Азербайджан', 'Провинция Йезд', 'Провинция Зенджан']
},
{
    countryEng: "Ireland",
    countryName: "Ирландия",
    countryRegion: ['Леинстер', 'Мюнстер', 'Ольстер', 'Коннахт']
},
{
    countryEng: "Iceland",
    countryName: "Исландия",
    countryRegion: ['Восточный регион', 'Большой Рейкьявик', 'Северо-восточный регион', 'Южный регион', 'Западный регион', 'Вестфьордс']
},
{
    countryEng: "Spain",
    countryName: "Испания",
    countryRegion: ['Андалусия', 'Арагон', 'Балеарские острова', 'Астурия', 'Мадрид', 'Каталония', 'Валенсия', 'Мурсия', 'Канарские острова', 'Страна Басков', 'Кастилия-Леон', 'Галисия']
},
{
    countryEng: "Italy",
    countryName: "Италия",
    countryRegion: ['Абруцци', 'Апулия', 'Венеция', 'Калабрия', 'Кампания', 'Лацио', 'Лигурия', 'Ломбардия', 'Пьемонт', 'Сардиния', 'Сицилия', 'Тоскана', 'Трентино-Альто-Адидже', 'Умбрия', 'Фриули — Венеция-Джулия', 'Эмилия-Романья']
},
{
    countryEng: "Yemen",
    countryName: "Йемен",
    countryRegion: ['Аден', 'Баджиль', 'Дамар', 'Амран', 'Сана', 'Таиз', 'Ибб', 'Ходейда', 'Сада', 'Эль-Мукалла']
},
{
    countryEng: "Cape Verde",
    countryName: "Кабо-Верде",
    countryRegion: ['Прая', 'Минделу', 'Санта-Мария', 'Педра-Беджу', 'Асомада', 'Тараффал', 'Эшпаргуш']
},
{
    countryEng: "Kazakhstan",
    countryName: "Казахстан",
    countryRegion: ['Акмолинская область', 'Актюбинская область', 'Алматинсксая область', 'Атырауская область', 'Восточно-Казахстанская область', 'Город республиканского значения', 'Жамбылская область', 'Западно-Казахстанская область', 'Карагандинская область', 'Костанайская область', 'Кызылординская область', 'Мангистауская область', 'Павлодарская область', 'Северо-Казахстанская область', 'Туркестанская область']
},
{
    countryEng: "Cayman islands",
    countryName: "Каймановы острова",
    countryRegion: ['Бодден-Таун', 'Ист-Энд', 'Джорджтаун', 'Норт-Сайд', 'Уест-БейтКайман-Брак']
},
{
    countryEng: "Cambodia",
    countryName: "Камбоджа",
    countryRegion: ['Пномпень', 'Такмау', 'Баттамбанг', 'Сисопхон', 'Сиемреап', 'Кампонгтям', 'Кампонгсаом', 'Кампот', 'Кампонгчнанг', 'Кратьэх', 'Прейвэнг', 'Поусат', 'Самроунг', 'Стынгтраенг', 'Свайриенг', 'Сенмонором', 'Банлунг']
},
{
    countryEng: "Cameroon",
    countryName: "Камерун",
    countryRegion: ['Адамава', 'Восточный', 'Западный', 'Крайнесеверный', 'Прибрежный', 'Северный', 'Северо-Западный', 'Центральный', 'Юго-Западный', 'Южный']
},
{
    countryEng: "Canada",
    countryName: "Канада",
    countryRegion: ['Альберта', 'Британская Колумбия', 'Канада', 'Квебек', 'Манитоба', 'Новая Шотландия', 'Нунавут', 'Нью-Брансуик', 'Ньюфаундленд и Лабрадор', 'Онторио', 'Остров Принца Эдуарда', 'Саскачеван', 'Северо-западные территории', 'Юкон']
},
{
    countryEng: "Canary islands",
    countryName: "Канарские острова",
    countryRegion: ['Санта-Крус-де-Тенерифе ', 'Лас-Пальмас']
},
{
    countryEng: "Qatar",
    countryName: "Катар",
    countryRegion: ['Аль-Шамаль', 'Аль-Райян', 'Доха', 'Умм Салал', 'Аль Даайен', 'Аль Хор', 'Аль-Вакра']
},
{
    countryEng: "Kenya",
    countryName: "Кения",
    countryRegion: ['Центральная', 'Прибрежная', 'Восточная', 'Найроби', 'Северо-Восточная', 'Ньянза', 'Рифт-Валли', 'Западная']
},
{
    countryEng: "Cyprus",
    countryName: "Кипр",
    countryRegion: ['Лимасол', 'Никосия', 'Ларнака', 'Пафос', 'Фамагуста']
},
{
    countryEng: "Kyrgyzstan",
    countryName: "Киргизия",
    countryRegion: ['Баткенская область', '	город республиканского подчинения', 'Джалал-Абадская область', 'Иссык-Кульская область', 'Нарынская область', 'Ошская область', 'Чуйская область', 'Таласская область', 'Чуйская область']
},
{
    countryEng: "Kiribati",
    countryName: "Кирибати",
    countryRegion: ['Южная Тарава', 'Табурао', 'Бонрики', 'Буарики', 'Темарая', 'Бутаритари', 'Утироа', 'Табукиниберу', 'Раваннавани', 'Табангетуа']
},
{
    countryEng: "China",
    countryName: "Китай",
    countryRegion: ['Восточный Китай', 'Северный Китай', 'Северо-Восточный Китай', 'Северо-Западный Китай', 'Южный Центральный Китай', 'Южный Западный Китай']
},
{
    countryEng: "Colombia",
    countryName: "Колумбия",
    countryRegion: ['Кундинамарка', 'Антьокия', 'Валье-дель-Каука', 'Атлантико', 'Боливар', 'Северный Сантандер', 'Толима', 'Сантандер', 'Мета', 'Магдалена', 'Рисаральда', 'Сесар', 'Кордова', 'Нариньо', 'Кальдас', 'Уила', 'Киндио', 'Сукре ', 'Каука', 'Гуахира']
},
{
    countryEng: "Comoros",
    countryName: "Коморы",
    countryRegion: ['Нгазиджа', 'Ндзуани', 'Мвали']
},
{
    countryEng: "Congo",
    countryName: "Конго",
    countryRegion: ['Браззавиль', 'Куилу', 'Ниари', 'Буэнза', 'Кювет', 'Плато', 'Ликуала', 'Лекуму', 'Пул', 'Санга']
},
{
    countryEng: "Congo-Kinshasa",
    countryName: "Конго-Киншаса",
    countryRegion: ['Кишаса', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ]
},
{
    countryEng: "Costa Rica",
    countryName: "Коста-Рика",
    countryRegion: ['Сан-Хосе', 'Картаго', 'Лимон', 'Алахуэла', 'Гуанакасте']
},
{
    countryEng: "Cote d'Ivoire",
    countryName: "Кот-д’Ивуар",
    countryRegion: ['Абиджан', 'Буаке', 'Далоа', 'Ямусукро', 'Корого', 'Ман', 'Сан-Педро', 'Ганьоа', 'Диво', 'Аньяма', 'Абенгуру', 'Субре', 'Гран-Басам', 'Дабу', 'Агбовиль', 'Дуэкуэ', 'Буафле', 'Синфра', 'Бондуку', 'Катиола', 'Сегела', 'Феркеседугу', 'Димбокро', 'Исиа', 'Гигло', 'Бинжервиль', 'Адзопе', 'Данане', 'Уме', 'Одиенне', 'Аньибилекру', 'Абоисо', 'Бонуа', 'Сасандра']
},
{
    countryEng: "Cuba",
    countryName: "Куба",
    countryRegion: ['Гавана', 'Сантьяго-де-Куба', 'Камагуэй', 'Ольгин', 'Гуантанамо', 'Вилья-Клара', 'Лас-Тунас', 'Гранма', 'Сьенфуэгос', 'Пинар-дель-Рио', 'Матансас', 'Сьего-де-Авила', 'Санкти-Спиритус', 'Артемиса', 'Маябеке']
},
{
    countryEng: "Kuwait",
    countryName: "Кувейт",
    countryRegion: ['Хавалли', 'Фарвания', 'Ахмади', 'Джахра', 'Асама', 'Мубарак-эль-Кабир']
},
{
    countryEng: "Laos",
    countryName: "Лаос",
    countryRegion: ['Префектура Вьентьян', 'Тямпасак', 'Саваннакхет', 'Луанг Прабанг', 'Хуапань', 'Сянкхуанг', 'Удомсай', 'Вьентьян', 'Болихамсай', 'Аттапеу', 'Бокео', 'Луанг Намта', 'Пхонгсали', 'Сайнябули', 'Салаван', 'Секонг']
},
{
    countryEng: "Latvia",
    countryName: "Латвия",
    countryRegion: ['Рижский', 'Пририжский', 'Видземский', 'Курземский', 'Земгальский', 'Латгальский']
},
{
    countryEng: "Lesotho",
    countryName: "Лесото",
    countryRegion: ['Масеру', 'Хлоце', 'Мафетенг', 'Теятеяненг', 'Мапуцоэ', 'Мохалес-Хук', 'Цгачас-Нек', 'Цгутхинг', 'Мокхотлонг', 'Бутха-Бутхе', 'Тхаба-Цека']
},
{
    countryEng: "Liberia",
    countryName: "Либерия",
    countryRegion: ['Боми', 'Бонг', 'Гбарполу', 'Гранд-Басса', 'Гранд-Джиде', 'Гранд-Кейп-Маунт', 'Гранд-Кру', 'Лофа', 'Маргиби', 'Монтсеррадо', 'Мэриленд', 'Нимба', 'Ривер-Ги', 'Ривер-Сесс', 'Сино']
},
{
    countryEng: "Lebanon",
    countryName: "Ливан",
    countryRegion: ['Бейрут', 'Северный Ливан', 'Южный Ливан', 'Эн-Набатия', 'Горный Ливан', 'Бекаа']
},
{
    countryEng: "Libya",
    countryName: "Ливия",
    countryRegion: ['Бенгази', 'Вади-эль-Хаят', 'Дерна', 'Марзук', 'Мисурата', 'Налут', 'Сабха', 'Сирт', 'Сурт', 'Триполи', 'Эз-Завия', 'Эль-Бутнан', 'Эль-Вахат', 'Эль-Джебель-эль-Гарби', 'Эль-Джебель-эль-Ахдар', 'Эль-Джуфра', 'Эль-Куфра', 'Эль-Маргаб', 'Эль-Мардж', 'Эн-Нугат-эль-Хумс']
},
{
    countryEng: "Lithuania",
    countryName: "Литва",
    countryRegion: ['Алитусский', 'Вильнюсский', 'Каунасский', 'Клайпедский', 'Мариямпольский', 'Паневежский', 'Таурагский', 'Тельшяйский', 'Утенский', 'Шяуляйский']
},
{
    countryEng: "Liechtenstein",
    countryName: "Лихтенштейн",
    countryRegion: ['Руггель', 'Шелленберг', 'Гамприн', 'Эшен', 'Маурен', 'Шаан', 'Планкен', 'Вадуц', 'Triesenberg', 'Тризен', 'Balzers']
},
{
    countryEng: "Luxembourg",
    countryName: "Люксембург",
    countryRegion: ['Вианден', 'Вильц', 'Гревенмахер', 'Дикирх', 'Эш-сюр-Альзетт', 'Люксембург', 'Ремих', 'Эхтернах']
},
{
    countryEng: "Mauritius",
    countryName: "Маврикий",
    countryRegion: ['Округ Порт-Луи', 'Плейнс-Вилмс', 'Ривьер-Нуар', 'Ривьер-дю-Ремпар', 'Памплемус', 'Саванский округ', 'Гранд-Порт', 'Флак', 'Мока']
},
{
    countryEng: "Mauritania",
    countryName: "Мавритания",
    countryRegion: ['Нуакшот', 'Дахлет Нуадибу', 'Ассабский', 'Ход-Эч-Чарги', 'Горгольский', 'Тирис-Земмур', 'Бракна', 'Гуидимака', 'Трарза', 'Адрар', 'Тагант', 'Ход-эль-Гарби', 'Инчири']
},
{
    countryEng: "Madagascar",
    countryName: "Мадагаскар",
    countryRegion: ['Антананариву', 'Анциранана', 'Махаджанга', 'Тулиара', 'Тоамасина', 'Фианаранцуа']
},
{
    countryEng: "Macedonia",
    countryName: "Македония",
    countryRegion: ['Македония', 'Вардарская Македония', 'Пиринская Македония']
},
{
    countryEng: "Malawi",
    countryName: "Малави",
    countryRegion: ['Северный регион', 'Центральный регион', 'Южный регион']
},
{
    countryEng: "Malaysia",
    countryName: "Малайзия",
    countryRegion: ['Кедах', 'Джохор', 'Малакка', 'Негери Сембилан', 'Пенанг', 'Перак', 'Сабах', 'Саравак', 'Селангор', 'Теренггану', 'Федеральные территории Малайзии']
},
{
    countryEng: "Mali",
    countryName: "Мали",
    countryRegion: ['Кайс', 'Бамако', 'Гао', 'Сегу', 'Куликоро', 'Диоила', 'Мопти', 'Томбукту', 'Сикассо']
},
{
    countryEng: "Maldives",
    countryName: "Мальдивы",
    countryRegion: ['Алиф-Алиф', 'Баа', 'Вааву', 'Гаафу-Алиф', 'Гнавийяни', 'Дхаалу', 'Каафу', 'Лааму', 'Лавийани', 'Мале', 'Меему', 'Нуну', 'Раа', 'Сиину', 'Тхаа', 'Фаафу', 'Хаа-Алиф', 'Хаа-Даалу', 'Шавияни']
},
{
    countryEng: "Malta",
    countryName: "Мальта",
    countryRegion: ['Гозо', 'Северный регион', 'Юго-Восточный регион', 'Южный регион']
},
{
    countryEng: "Morocco",
    countryName: "Марокко",
    countryRegion: ['Бени Меллал-Хенифра', 'Касабланка-Сеттат', 'Дра-Тафилалет', 'Фес-Мекнес', 'Гелмим-Эс Семара', 'Гелмим-Од ', 'Марракеш-Сафи', 'Восточный', 'Рабат-Сале-Кенитра', 'Сус-Масса', 'Танжер-Тетуан-Аль-Хосейма']
},
{
    countryEng: "Martinique",
    countryName: "Мартиника",
    countryRegion: ['Фор-де-Франс', 'Ла-Трините', 'Ле-Марен', 'Сен-Пьер']
},
{
    countryEng: "Marshall Islands",
    countryName: "Маршалловы острова",
    countryRegion: ['Аджелтаке', 'Делап-Улига-Джаррит', 'Остров Эбей', 'Лаура', 'Райрок']
},
{
    countryEng: "Mexico",
    countryName: "Мексика",
    countryRegion: ['Агуаскальентес', 'Веракрус', 'Герреро', 'Гуанахуато', 'Дуранго', 'Идальго', 'Кампече', 'Кинтана-Роо', 'Коауила', 'Колима', 'Мексика', 'Мехико', 'Мичоакан', 'Морелос', 'Наярит', 'Нижняя Калифорния', 'Нуэво-Леон', 'Оахака', 'Пуэбла', 'Сакатекас', 'Сан-Луис-Потоси', 'Синалоа', 'Сонора', 'Табаско', 'Тамаулипас', 'Халиско', 'Чихуахуа', 'Чьяпас', 'Южная Нижняя Калифорния', 'Юкатан']
},
{
    countryEng: "Mozambique",
    countryName: "Мозамбик",
    countryRegion: ['Кабу-Делгаду', 'Газа', 'Иньямбане', 'Маника', 'Мапуту', 'Нампула', 'Ньяса', 'Софала', 'Тете', 'Замбезия']
},
{
    countryEng: "Moldova",
    countryName: "Молдова",
    countryRegion: ['Северная молдова', 'Центральная Молдова', 'Мун. Кишинэу', 'юг Молдовы', 'Приднестровье', 'Гагаузия']
},
{
    countryEng: "Monaco",
    countryName: "Монако",
    countryRegion: ['Город Монако', 'Монте-Карло', 'Лa Русс', 'Ларвотто', 'Сен-Мишель', 'Ла Кондамин']
},
{
    countryEng: "Mongolia",
    countryName: "Монголия",
    countryRegion: ['Архангай', 'Баян-Улгий', 'Баянхонгор', 'Булган', 'Говь-Алтай', 'Говь-Сумбэр', 'Дархан-Уул', 'Дорноговь', 'Дорнод', 'Дундговь', 'Завхан', 'Орхон', 'Сухэ-Батор', 'Сэлэнгэ', 'Туве', 'Уверхангай', 'Увс', 'Улан-Батор', 'Умнеговь', 'Ховд', 'Хувсгел', 'Хентий']
},
{
    countryEng: "Myanmar",
    countryName: "Мьянма",
    countryRegion: ['Янгон', 'Мандалай', 'Пегу', 'Иравади', 'Магуэ', 'Сикайн', 'Танинтайи', 'Аракан', 'Карен', 'Кайя', 'Качин', 'Мон', 'Чин', 'Шан']
},
{
    countryEng: "Namibia",
    countryName: "Намибия",
    countryRegion: ['Эронго', 'Хомас', 'Регион Отджозонджупа', 'Хардап', 'Кунене', 'Омахеке', 'Ошикото', 'Карас']
},
{
    countryEng: "Nauru",
    countryName: "Науру",
    countryRegion: ['Айво', 'Анабар', 'Анетан', 'Анибаре', 'Баити', 'Бо', 'Буада', 'Денигомоду', 'Ева', 'Июв', 'Мененг', 'Нибок', 'Ярен']
},
{
    countryEng: "Nepal",
    countryName: "Непал",
    countryRegion: ['Провинция Багмати', 'Гандаки', 'Провинция №1', 'Провинция №2', 'Провинция Лумбини', 'Судурпащимская область', 'Провинция Карнали']
},
{
    countryEng: "Niger",
    countryName: "Нигер",
    countryRegion: ['Агадес', 'Диффа', 'Доссо', 'Маради', 'Ниамей', 'Тахуа', 'Тиллабери', 'Зиндер']
},
{
    countryEng: "Nigeria",
    countryName: "Нигерия",
    countryRegion: ['Северная область', 'Западная область', 'Среднезападная область']
},
{
    countryEng: "Netherlands",
    countryName: "Нидерланды",
    countryRegion: ['Дренте', 'Флеволанд', 'Фрисландия', 'Гелдерланд', 'Гронинген', 'Лимбург', 'Северный Брабант', 'Северная Голландия', 'Оверэйсел', 'Южная Голландия', 'Утрехт', 'Зеландия']
},
{
    countryEng: "Nicaragua",
    countryName: "Никарагуа",
    countryRegion: ['Манагуа', 'Леон', 'Чинандега', 'Масая', 'Эстели', 'Матагальпа', 'Гранада', 'Чонталес', 'Хинотега', 'Атлантико-Норте', 'Атлантико-Сур', 'Карасо', 'Нуэва-Сеговия', 'Ривас', 'Боако', 'Мадрис', 'Рио-Сан-Хуан']
},
{
    countryEng: "New Zealand",
    countryName: "Новая Зеландия",
    countryRegion: ['Веллингтон', 'Гамильтон', 'Гисборн', 'Данидин', 'Инверкаргилл', 'Капити', 'Крайстчерч', 'Нейпир-Хейстингс', 'Нельсон', 'Нью-Плимут', 'Окленд', 'Палмерстон-Норт', 'Роторуа', 'Тауранга', 'Уонгануи', 'Фангареи', ]
},
{
    countryEng: "Norway",
    countryName: "Норвегия",
    countryRegion: ['Акерсхус', 'Бускеруд', 'Вест-Агдер', 'Вестфолл', 'Мёре-ог-Ромсдал', 'Нурланн', 'Нур-Трёнделаг', 'Оппланн', 'Ругаланн', 'Сёр-Трёнделаг', 'Согн-ог-Фьюране', 'Телемарк', 'Тромс', 'Финнмарк', 'Хедмарк', 'Хордаланн', 'Эстфолл', 'Эуст-Агдер']
},
{
    countryEng: "UAE",
    countryName: "ОАЭ",
    countryRegion: ['Абу-Даби', 'Аджман', 'Дубай', 'Рас-эль-Хайма', 'Умм-эль-Кайвайн', 'Шарджа', 'Эль-Фуджайра']
},
{
    countryEng: "Oman",
    countryName: "Оман",
    countryRegion: ['Маскат', 'Дофар', 'Эль-Батина', 'Эз-Захира', 'Эш-Шаркия', 'Эд-Дахилия', 'Мусандам']
},
{
    countryEng: "Saint Helena",
    countryName: "Остров Святой Елены",
    countryRegion: ['Аларм-Форест', 'Бахия-де-Санди', 'Блу-Хилл', 'Хаф-Три-Холлоу', 'Джеймстаун', 'Левелвуд', 'Лонгвуд', 'Сент-Полс', 'Ройял Мэйл Шип', 'Джеймстаун Харбор']
},
{
    countryEng: "Pakistan",
    countryName: "Пакистан",
    countryRegion: ['Азад Кашмир', 'Белуджистан', 'Хайбер-Пахтунхва', 'Пенджаб', 'Синд', 'Исламабадская столичная территория']
},
{
    countryEng: "Palau",
    countryName: "Палау",
    countryRegion: ['Аираи', 'Бкулангрилл', 'Клоулклабед', 'Корор', 'Меюнс', 'Нгерулмуд', 'Нгеткиб']
},
{
    countryEng: "Panama",
    countryName: "Панама",
    countryRegion: ['КоклеБокас - дель - Торо', 'Чирики', 'Колон', 'Эррера', 'Лос Сантос', 'Панама', 'Панама Эст', 'Верагуас']
},
{
    countryEng: "Papua New Guinea",
    countryName: "Папуа - Новая Гвинея",
    countryRegion: ['Айлендс', 'Автономный регион Бугенвиль', 'Момасе', 'Папуа', 'Хайлендс']
},
{
    countryEng: "Paraguay",
    countryName: "Парагвай",
    countryRegion: ['Альто-Парана', 'Амамбай', 'Итапуа', 'Каагуасу', 'Канендию', 'Консепсьон', 'Центральный департамент']
},
{
    countryEng: "Peru",
    countryName: "Перу",
    countryRegion: ['Амазонас', 'Анкаш', 'Апуримак', 'Арекипа', 'Аякучо', 'Кахамарка', 'Куско', 'Хуанкавалека', 'Уануко', 'Ика', 'Хунин', 'Ла Либертад', 'Ламбаеке', 'Лима', 'Лорето', 'Мадре-де-Диос', 'Мокегуа', 'Паско', 'Пьюра', 'Пуно', 'Сан-Мартин', 'Такна', 'Тумбес', 'Укаяли']
},
{
    countryEng: "Poland",
    countryName: "Польша",
    countryRegion: ['Варминьско-Мазурское воеводство', 'Великопольское воеводство', 'Западно-Поморское воеводство', 'Куявско-Поморское воеводство', 'Лодзинское воеводство', 'Люблинское воеводство', 'Любушское воеводство', 'Мазовецкое воеводство', 'Малопольское воеводство', 'Нижнесилезское воеводство', 'Опольское воеводство', 'Подкарпатское воеводство', 'Подляское воеводство', 'Поморское воеводство', 'Свентокшиское воеводство', 'Силезское воеводство']
},
{
    countryEng: "Portugal",
    countryName: "Португалия",
    countryRegion: ['Округ Авейру', 'Азорские острова', 'Район Бежа', 'Брага', 'Браганса', 'Каштелу-Бранку', 'Коимбра', 'Эвора', 'Округ Фару', 'Гуарда', 'Округ Лейрия', 'Лиссабон', 'Мадейра', 'Округ Порталегре', 'Порту', 'Сантарен', 'Сетубальский район', 'Виана-ду-Каштелу', 'Вила-Реал', 'Висеу']
},
{
    countryEng: "Puerto Rico",
    countryName: "Пуэрто-Рико",
    countryRegion: ['Мона', 'Вьекес', 'Кулебра', 'ДесечеоКаха-де-Муэртос']
},
{
    countryEng: "Reunion",
    countryName: "Реюньон",
    countryRegion: ['Сен-Бенуа', 'Сен-Дени', 'Сен-Поль', 'Сен-Пьер']
},
{
    countryEng: "Russia",
    countryName: "Россия",
    countryRegion: ['Алтайский край', 'Республика Алтай', 'Амурская область', 'Архангельская область', 'Астраханская область', 'Белгородская область', 'Брянская область', 'Чеченская Республика', '	Челябинская область', 'Чукотский автономный округ', '	Чувашская Республика', 'Дагестан', 'Ингушетия', 'Иркутская область', 'Ивановская область', 'Еврейская автономная область', '	Кабардино-Балкарская Республика', '	Калининградская область', 'Калмыкия', 'Калужская область', 'Камчатский край', 'Карачаево-Черкесия', 'Карелия', 'Кемеровская область', 'Хабаровский край', 'Ханты-Мансийский автономный округ', 'Кировская область', 'Республика Коми', 'Костромская область', 'Краснодарский край', 'Красноярский край', 'Курганская область', 'Курская область', 'Ленинградская область', 'Липецкая область', 'Магаданская область', 'Марий Эл', 'Москва', 'Московская область', 'Мурманская область', 'Ненецкий автономный округ', 'Нижегородская область', 'Новгородская область', 'Новосибирская область', 'Омская область', 'Оренбургская область', 'Орловская область', 'Пензенская область', 'Пермский край', 'Приморский край', 'Псковская область', 'Республика Адыгея', 'Республика Башкортостан', 'Республика Бурятия', 'Республика Хакасия', 'Республика Мордовия', 'Республика Северная Осетия - Алания', 'Республика Татарстан', 'Ростовская область', 'Рязанская область', 'Санкт-Петербург', 'Республика Саха', 'Сахалинская область', 'Самарская область', '	Саратовская область', 'Смоленская область', 'Ставропольский край', 'Свердловская область', 'Тамбовская область', 'Томская область', 'Тульская область', 'Республика Тыва', 'Тверская область', 'Тюменская область', 'Удмуртия', 'Ульяновская область', 'Владимирская область', 'Волгоградская область', 'Вологодская область', 'Воронежская область', 'Ямало-Ненецкий автономный округ', 'Ярославская область', 'Забайкальский край']
},
{
    countryEng: "Rwanda",
    countryName: "Руанда",
    countryRegion: ['Кигали', 'Южная провинция', 'Северная провинция', 'Западная провинция', 'Восточная провинция']
},
{
    countryEng: "Romania",
    countryName: "Румыния",
    countryRegion: ['Бухарест', 'Алба', 'Арджеш', 'Бакэу', 'Бистрица-Нэсэуд', 'Бихор', 'Ботошани', 'Брашов', 'Брэила', 'Бузэу', 'Васлуй', 'Вранча', 'Вылча', '	Галац', 'Горж', 'Джурджу', 'Долж', 'Дымбовица', 'Илфов', 'Караш-Северин', 'Клуж', 'Ковасна', 'Констанца', 'Кэлэраши', 'Марамуреш', 'Мехединци', 'Муреш', 'Нямц', 'Олт', 'Прахова', 'Сату-Маре', 'Сибиу', 'Сучава', 'Сэлаж', 'Телеоман', 'Тимиш', 'Тулча', 'Харгита', 'Хунедоара', 'Яломица', 'Яссы']
},
{
    countryEng: "Salvador",
    countryName: "Сальвадор",
    countryRegion: ['Сан-Сальвадор', 'Сан-Мигель', 'Санта-Ана', 'Ла-Либертад', 'Сонсонате', 'Кускатлан', 'Усулутан', 'Ауачапан', 'Сан-Висенте', 'Ла-Пас', 'Ла-Уньон', 'Кабаньяс', 'Чалатенанго', 'Морасан']
},
{
    countryEng: "Samoa",
    countryName: "Самоа",
    countryRegion: ['Апиа', 'Ваителе', 'Леауваа', 'Малие', 'Афега']
},
{
    countryEng: "San Marino",
    countryName: "Сан-Марино",
    countryRegion: ['Аккуавива', 'Борго-Маджоре', 'Кьезануова', 'Сан-Марино', 'Доманьяно', 'Фаэтано', 'Фьорентино', 'Монтеджардино', 'Серравалле']
},
{
    countryEng: "Sao Tome and Principe",
    countryName: "Сан-Томе и Принсипи",
    countryRegion: ['Агуа-Гранде', 'Лобата', 'Лемба', 'Кантагалу', 'Ми-Сочи', 'Кауи', 'Паге']
},
{
    countryEng: "Saudi Arabia",
    countryName: "Саудовская Аравия",
    countryRegion: ['Эр-Рияд', 'Мекка', 'Медина', 'Эш-Шаркия', 'Табук', 'Эль-Касим', 'Асир', 'Хаиль', 'Наджран', 'Эль-Худуд-эш-Шамалия', 'Джизан', 'Эль-Джауф']
},
{
    countryEng: "Swaziland",
    countryName: "Свазиленд",
    countryRegion: ['Хохо', 'Лубомбо', 'Манзини', 'Шиселвени']
},
{
    countryEng: "North Korea",
    countryName: "Северная Корея",
    countryRegion: ['Особые города Кореи', 'Хамгён-Намдо', 'Хамгён-Пукто', 'Пхёнан-Намдо', 'Хванхэ-Пукто', 'Пхёнан-Пукто', 'Хванхэ-Намдо', 'Чагандо', 'Янгандо']
},
{
    countryEng: "North Macedonia",
    countryName: "Северная Македония",
    countryRegion: ['Вардарский', 'Восточный', 'Юго-Западный', 'Пелагонийский', 'Положский', 'Юго-Восточный', 'Северо-Восточный', 'Скопский']
},
{
    countryEng: "Seychelles",
    countryName: "Сейшелы",
    countryRegion: ['Маэ', 'Виктория', 'Силуэт', 'Праслен', 'Ла-Диг']
},
{
    countryEng: "Saint Martin",
    countryName: "Сенегал",
    countryRegion: ['Дакар', 'Диурбель', 'Тиес', 'Каолак', 'Сен-Луи', 'Зигиншор', 'Луга', 'Тамбакунда', 'Колда', 'Кафрин', 'Фатик']
},
{
    countryEng: "Saint Martin",
    countryName: "Сен-Мартен",
    countryRegion: ['Нижний Рейн', 'Селеста-Эрстен', 'Мюциг']
},
{
    countryEng: "Saint Vincent and the Grenadines",
    countryName: "Сент-Винсент и Гренадины",
    countryRegion: ['Бекия', 'Кануан', 'Мейро', 'Мастяк', 'Катр', 'Сент-Винсент', 'Остров Юнион']
},
{
    countryEng: "Saint Kitts and Nevis",
    countryName: "Сент-Китс и Невис",
    countryRegion: ['Сент-Томас-Лоуленд', 'Сент-Джон Фигтри', 'Святого Георгия в Джинджерленд', 'Сент-Пол Чарлстаун', 'Сент-Джеймс Наветренный', 'Святого Георгия Победоносца', 'Тринити-Пальметто-Пойнт', 'Сент-Томас Мидл-Айленд', 'Сент-Энн-Сэнди-Пойнт', 'Сен-Поль Капистерре', 'Святого Иоанна Капистерре', 'Церковь Христа', 'Святой Марии Кайон', 'Святого Петра Бастера']
},
{
    countryEng: "Saint Lucia",
    countryName: "Сент-Люсия",
    countryRegion: ['Анс-ла-Рей', 'Кастри', 'Шуазёль', 'Дофен', 'Деннери', 'Гроз-Иле', 'Лабори', 'Мику', 'Прален', 'Суфриер', 'Вьё-Фор']
},
{
    countryEng: "Serbia",
    countryName: "Сербия",
    countryRegion: ['Борский район', 'Браничевский район', 'Центральный Банатский район', 'Ябланицкий район', 'Колубарский район', 'Мачвинский район', 'Моравицкий район', 'Нишавский район', 'Северная Бачка', 'Северный Банатский район', 'Пчиня', 'Пиротский район', 'Подунавльский район', 'Поморавльский район', 'Расинский район', 'Рашка', 'Южный район Бачка', 'Южный район Бачка', 'Сремский район', 'Шумадийский район', 'Топличский район', 'Западный округ Бачка', 'Заечарский район', 'Златибор', 'Белград']
},
{
    countryEng: "Singapore",
    countryName: "Сингапур",
    countryRegion: ['Центральный регион', 'Восточный регион', 'Северный регион', 'Северо-Восточный регион', 'Западный регион']
},
{
    countryEng: "Syria",
    countryName: "Сирия",
    countryRegion: ['Алеппо', 'Дайр-эз-Заур', 'Дамаск', 'Даръа', 'Идлиб', 'Эль-Кунейтра', 'Латакия', 'Тартус', 'Хама', 'Хомс', 'Эль-Хасака', 'Эр-Ракка', 'Эс-Сувайда']
},
{
    countryEng: "Slovakia",
    countryName: "Словакия",
    countryRegion: ['Банска-Бистрицкий край', 'Братиславский регион', 'Жилинский', 'Кошицкий', 'Нитра', 'Прешовский', 'Тренчинский край', 'Трнавский']
},
{
    countryEng: "Slovenia",
    countryName: "Словения",
    countryRegion: ['Любляна', 'Марибор', 'Савиньска', 'Гореньска', 'Обално-Крашка', 'Юго-Восточная Словения', 'Подравска', 'Засавска', 'Средняя Словения', 'Горишка', 'Средняя Словения', 'Помурска']
},
{
    countryEng: "Solomon islands",
    countryName: "Соломоновы Острова",
    countryRegion: ['Гуадалканал', 'Малаита', 'Западная провинция', 'Макира-Улава', 'Темоту', 'Центральная провинция', 'Исабель', 'Шуазёль', 'Реннелл и Беллона']
},
{
    countryEng: "Somalia",
    countryName: "Сомали",
    countryRegion: ['Могадишо', 'Харгейса', 'Буръо', 'Босасо', 'Беледуэйне', 'Бербера', 'Байдабо', 'Галькайо', 'Борама', 'Кисмайо', 'Ласъанод', 'Джоухар', 'Гароуэ', 'Бардере', 'Кардо', 'Марка', 'Афгойе', 'Джамаме', 'Корьолей', 'Джилиб']
},
{
    countryEng: "Sudan",
    countryName: "Судан",
    countryRegion: ['Хартум', 'Южный Дарфур', 'Красное море', 'Северный Кордофан', 'Кассала', 'Гезира', 'Аль-Кадариф', 'Северный Дарфур']
},
{
    countryEng: "Suriname",
    countryName: "Суринам",
    countryRegion: ['Парамарибо', 'Ваника', 'Никкери', 'Маровейне', 'Коммевейне', 'Сарамакка', 'Брокопондо', 'Пара', 'Корони']
},
{
    countryEng: "USA",
    countryName: "США",
    countryRegion: ['Алабама', 'Аляска', 'Американское Самоа', 'Аризона', 'Арканзас', 'Калифорния', 'Колорадо', 'Коннектикут', 'Делавэр', 'Округ Колумбия', 'Флорида', 'Гуам', 'Гавайи', 'Айдахо', 'Иллинойс', 'Индиана', 'Айова', 'Канзас ', 'Кентукки', 'Луизиана', 'Мэн', 'Мэриленд', 'Массачусетс', 'Мичиган', 'Миннесота', 'Миссисипи', 'Миссури', 'Монтана', 'Небраска ', 'Невада ', 'Нью-Гэмпшир', 'Нью-Джерси', 'Нью-Мексико', 'Нью-Йорк', 'Северная Дакота', 'Огайо', 'Оклахома', 'Орегон', 'Пенсильвания', 'Пуэрто-Рико', 'Род-Айленд', 'Южная Каролина', 'Теннесси', 'Техас', 'Юта', 'Вермонт', 'Виргина', 'Вашингтон', 'Висконсон']
},
{
    countryEng: "Sierra Leone",
    countryName: "Сьерра-Леоне",
    countryRegion: ['Западная область', 'Южная провинция', 'Северная провинция', 'Восточная провинция']
},
{
    countryEng: "Tajikistan",
    countryName: "Таджикистан",
    countryRegion: ['Душанбе', 'Согдийская область', 'Хатлонская область', 'Районы находящиеся под юрисдикцией центрального правительства', 'Горно-Бадахшанская Автономная Область']
},
{
    countryEng: "Taiwan",
    countryName: "Тайвань",
    countryRegion: ['Уезд Чанхуа', 'Уезд Юньлинь', 'Уезд Хуалянь', 'Пэнху', 'Округ Мяоли', 'Уезд Наньтоу', 'Уезд Пиндун', 'Уезд Цзяи', 'Уезд Илань', 'Тайдун', 'Уезд Синьчжу']
},
{
    countryEng: "Тайланд",
    countryName: "Тайланд",
    countryRegion: ['Амнатчарен', 'Ангтхонг', 'Аюттхая', 'Бангкок', 'Бурирам', 'Каласин', 'Кампхэнгпхет', 'Канчанабури', 'Краби', 'Кхонкэн', 'Лампанг', 'Лампхун', 'Лей', 'Лопбури', 'Махасаракхам', 'Мукдахан', 'Мэхонгсон', 'Накхоннайок', 'Накхонпатхом', 'Накхонратчасима', 'Накхонсаван', 'Накхонситхаммарат', 'Нан', 'Наратхиват', 'Нонгбуалампху', 'Нонгкхай', 'Нонтхабури', 'Паттани', 'Патхумтхани', 'Прачинбури', 'Прачуапкхирикхан', 'Пхангнга', 'Пхаяу', 'Пхетбури', 'Пхетчабун', 'Пхитсанулок', 'Пхичит', 'Пхрэ', 'Пхукет', 'Районг', 'Ратбури', 'Ройет', 'Саконнакхон', 'Сакеу', 'Самутпракан', 'Самутсакхон', 'Самутсонгкхрам', 'Сарабури', 'Сатун', 'Сингбури', 'Сисакет', 'Сонгкхла', 'Сукхотхай', 'Супханбури', 'Сураттхани', 'Сурин', 'Так', 'Транг', 'Трат', 'Убонратчатхани', 'Удонтхани', 'Уттарадит', 'Утхайтхани', 'Чайнат', 'Чайяпхум', 'Чантхабури', 'Чаченгсау', 'Чиангмай', 'Чонбури', 'Чумпхон', 'Яла', 'Ясотхон']
},
{
    countryEng: "Tanzania",
    countryName: "Танзания",
    countryRegion: ['Дар-эс-Салам', 'Мванза', 'Занзибар Западный', 'Аруша', 'Мбея', 'Морогоро', 'Танга', 'Кигомо', 'Додома', 'Табора', 'Килиманджаро', 'Кагера', 'Мара', 'Рувума', 'Иринга', 'Шиньянга', 'Руква']
},
{
    countryEng: "Togo",
    countryName: "Того",
    countryRegion: ['Морской', 'Центральный регион', 'Кара', 'Плато', 'Саванес']
},
{
    countryEng: "Tonga",
    countryName: "Тонга",
    countryRegion: ['Нукуалофа', 'Муа', 'Неиафу', 'Хавелолото', 'Ваини', 'Тофоа-Колоа', 'Пангаи', 'Охонуа', 'Хихифо']
},
{
    countryEng: "Trinidad and Tobago",
    countryName: "Тринидад и Тобаго",
    countryRegion: ['Диего-Мартин', 'Сан-Хуан — Лавентиль', 'Тунапуна-Пиарко', 'Кува — Табаките — Тальпаро', 'Майаро — Рио-Кларо', 'Сангре-Гранде', 'Принсес-Таун', 'Пенал-Дебе', 'Сипария']
},
{
    countryEng: "Tuvalu",
    countryName: "Тувалу",
    countryRegion: ['Ваиаку', 'Асау', 'Лолуа', 'Сававе', 'Куа', 'Танраке', 'Тонго', 'Фангауа', 'Фунафути', 'Куля', 'Сенала']
},
{
    countryEng: "Tunisia",
    countryName: "Тунис",
    countryRegion: ['Ариана', 'Бен Арус', 'Бизерта', 'Габес', 'Гафса', 'Кайруан', 'Сусс', 'Сфакс', 'Тунис', 'Мануба', 'Набуль', 'Загуан', 'Бежа', 'Джендуба', 'Кеф', 'Силиана', 'Монастир', 'Махдия']
},
{
    countryEng: "Turkmenistan",
    countryName: "Туркменистан",
    countryRegion: ['Ахалский', 'Ашхабад', 'Балканский', 'Дашогузский', 'Лебапский', 'Марыйский']
},
{
    countryEng: "Turkey",
    countryName: "Турция",
    countryRegion: ['Эгейский регион', 'Черноморский регион', 'Центральная Анатолия', 'Восточная Анатолия', 'Мраморноморский регион', 'Средиземноморский регион', 'Юго-Восточная Анатолия']
},
{
    countryEng: "Uganda",
    countryName: "Уганда",
    countryRegion: ['Центральная', 'Северная', 'Восточная', 'Западная']
},
{
    countryEng: "Uzbekistan",
    countryName: "Узбекистан",
    countryRegion: ['Андижанская область', 'Бухарская область', 'Джизакская область', 'Каракалпакстан', 'Кашкадарьинская область', 'Навоийская область', 'Наманганская область', 'Самаркандская область', 'Сурхандарьинская область', 'Сырдарьинская область', 'Ташкентская область', 'Ташкент', 'Ферганская область', 'Хорезмская область']
},
{
    countryEng: "Ukraine",
    countryName: "Украина",
    countryRegion: ['Винницкая область', 'Волынская область', 'Днепропетровская область', 'Донецкая область', 'Житомирская область', 'Закарпатская область', 'Запорожская область', 'Ивано-Франковская область', 'Киев', 'Киевская область', 'Кировоградская область', 'Луганская область', 'Львовская область', 'Николаевская область', 'Одесская область', 'Полтавская область', 'Ровненская область', 'Севастополь', 'Сумская область', 'Тернопольская область', 'Харьковская область', 'Херсонская область', 'Хмельницкая область', 'Черкасская область', 'Черниговская область', 'Черновицкая область']
},
{
    countryEng: "Wallis and Futuna",
    countryName: "Уоллис и Футуна",
    countryRegion: ['Алофи', 'Увеа', 'Футуна']
},
{
    countryEng: "Uruguay",
    countryName: "Уругвай",
    countryRegion: ['Артигас', 'Канелонес', 'Серро Ларго', 'Колония', 'Дуразно', 'Флорес', 'Флорида', 'Лаваллея', 'Мальдонадо', 'Пайсанду', 'Рио-Негро', 'Ривера', 'Роча', 'Сальто', 'Сан-Хосе', 'Сориано', 'Такуарембо', 'Трейнта-и-Трес']
},
{
    countryEng: "Fiji",
    countryName: "Фиджи",
    countryRegion: ['Ба', 'Лами', 'Левука', 'Наусори', 'Савусаву', 'Сигатока', 'Тавуа', 'Ракиракский район', 'Навуа', 'Коровов', 'Насину']
},
{
    countryEng: "Philippines",
    countryName: "Филиппины",
    countryRegion: ['Столичный регион', 'Давао', 'Центральные Висайи', 'Полуостров Замбоанга', 'Калабарсон', 'Северный Минданао', 'Соккссархен', 'Западные Висайи', 'Центральный Лусон']
},
{
    countryEng: "Finland",
    countryName: "Финляндия",
    countryRegion: ['Аландские острова', 'Восточная Финляндия', 'Западная и Внутренняя Финляндия', 'Лапландия', 'Северная Финляндия', 'Юго-западная Финляндия', 'Южная Финляндия']
},
{
    countryEng: "France",
    countryName: "Франция",
    countryRegion: ['Бретань', 'Бургундия — Франш-Конте', 'Гваделупа', 'Гвиана', 'Гранд-Эст', 'Пеи-де-ла-Луар', 'Иль-де-Франс', 'Корсика', 'Майотта', 'Мартиника', 'Новая Аквитания', 'Нормандия', 'О-де-Франс', 'Овернь — Рона — Альпы', 'Окситания', 'Прованс — Альпы — Лазурный Берег', 'Центр — Долина Луары']
},
{
    countryEng: "Croatia",
    countryName: "Хорватия",
    countryRegion: ['Беловар-Билогорский', 'Брод-Посавинский', 'Дубровницко-Неретванская', 'Истрийская', 'Карловацкий', 'Копривницко-Крижевский', 'Крапина-Загорский', 'Лицко-Сеньский', 'Меджимурский', 'Осиек-Бараньямаа', 'Пожегско-Славонский', 'Приморско-Горски-Котарский', 'Шибеник-Книнский', 'Сисак-Мославинский', 'Сплитско-Далматинская', 'Шибеник-Книнский']
},
{
    countryEng: "Central African Republic",
    countryName: "Центрально-африканская республика",
    countryRegion: ['Банги', 'Омбелла-Мпоко', 'Лобае', 'Мамбере-Кадеи', 'Нана-Гребизи', 'Уам-Пенде', 'Кемо', 'Уака', 'Верхнее Котто', 'Нана-Мамбере', 'Уам', 'Санга-Мбаэре', 'Мбому', 'Нижнее Котто', 'Верхнее Мбому', 'Баминги-Бангоран', 'Вакага']
},
{
    countryEng: "Chad",
    countryName: "Чад",
    countryRegion: ['Батха', 'Бахр-эль-Газаль', 'Борку', 'Ваддай', 'Вади-Фера', 'Восточное Майо-Кеби', 'Восточный Логон', 'Восточный Эннеди', 'Гера', 'Западное Майо-Кеби', 'Западный Логон', 'Западный Эннеди', 'Канем', 'Лак', 'Мандуль', 'Нджамена', 'Саламат', 'Сила', 'Среднее Шари', 'Танджиле', 'Тибести', 'Шари-Багирми', 'Хаджер-Ламис']
},
{
    countryEng: "Montenegro",
    countryName: "Черногория",
    countryRegion: ['Андриевица', 'Бар', 'Беране', 'Биело-Поле', 'Будва', 'Гусине', 'Даниловград', 'Жабляк', 'Колашин', 'Котор', 'Мойковац', 'Никшич', 'Плав', 'Плужине', 'Плевля', 'Тузи', 'Рожае', 'Тиват', 'Улцинь', 'Херцег-Нови', 'Цетине', 'Шавник']
},
{
    countryEng: "Czech",
    countryName: "Чехия",
    countryRegion: ['Высочинский', 'Градец-Краловский', 'Злин', 'Карловарский', 'Либерец', 'Моравско-силезский', 'Оломоуц', 'Пардубицкий', 'Пльзенский', 'Прага', 'Среднечешский', 'Усти-над-Лабем', 'Южноморавский', 'Южночешский']
},
{
    countryEng: "Chile",
    countryName: "Чили",
    countryRegion: ['Айсен-дель-Хенераль-Карлос-Ибаньес-дель-Кампо', 'Антофагаста', 'Араукания', 'Арика-и-Паринакота', 'Атакама', 'Био-Био', 'Вальпараисо', 'Кокимбо', 'Либертадор-Хенераль-Бернардо-О’Хиггинс', 'Лос-Лагос', 'Магальянес', 'Мауле', 'Столичная область', 'Тарапака']
},
{
    countryEng: "Switzerland",
    countryName: "Швейцария",
    countryRegion: ['Аарауский', 'Эгль', 'Андельфингенский', 'Арбон', 'Арлесхайм', 'Авеншский район', 'Баден', 'Берн', 'Берн-Миттелланд', 'Биль', 'Бишофсцелль', 'Будрский район', 'Бремгартен', 'Бройский район', 'Бругг', 'Бюлах', 'Контей', 'Коссанау', 'Делемон', 'Дильсдорф', 'Дитикон', 'Эшалленский район', 'Айнзидельн', 'Энтремонт', 'Эрлахский район', 'Фрауэнфельд', 'Глан', 'Внук', 'Грюйер', 'Хинтеррайн', 'Хорген', 'Интерлакен', 'Бернский Юра', 'Кройцлингенский район', 'Ла-Шо-де-Фон', 'Ла-Неввиль', 'Ландкварт', 'Лауфен', 'Лауфенбург', 'Лозанна', 'Лаво', 'Ле-Локль', 'Леберн', 'Ленцбургский район', 'Лойке', 'Локарно', 'Люцернский район', 'Лугано', 'Малойский район', 'Мартиньи', 'Майлен', 'Мендризио', 'Монте', 'Морж', 'Мудонский район', 'Невшательский район', 'Нидерзимменталь', 'Ньон', 'Оберааргау', 'Олтенский район', 'Орбе', 'Западный Лозаннуа', 'Пфеффиконский район', 'Поррентрю', 'Райнфельден', 'Рейнталь', 'Ролле', 'Роршах', 'Сен-Морис', 'Зарганзерланд', 'Сарин', 'Швиц', 'Видеть', 'Зиланд', 'Сьерре', 'Сион', 'Золотурн', 'Санкт-Галлен', 'Штекборн', 'Зурзе', 'Сурсельвский край', 'Тун', 'Тоггенбур', 'Трахзельвальдский округ', 'Округ Устер ', 'Валь-де-Рус', 'Валь-де-Траверс', 'Веве', 'Вевейский район', 'Висп', 'Вальденбургский район', 'Вангенский район', 'Верденберг', 'Вил', 'Виллизау', 'Винтертурский округ', 'Цюрих', 'Цурцах', 'Аарберг', 'Аппенцелль']
},
{
    countryEng: "Sweden",
    countryName: "Швеция",
    countryRegion: ['Блекинге', 'Вермланд', 'Вестерботтен', 'Вестерноррланд', 'Вестманланд', 'Вестра-Гёталанд', 'Готланд', 'Даларна', 'Евлеборг', 'Емтланд', 'Йёнчёпинг', 'Кальмар', 'Крунуберг', 'Норрботтен', 'Сёдерманланд', 'Сконе', 'Стокгольм', 'Уппсала', 'Халланд', 'Эребру', 'Эстергётланд']
},
{
    countryEng: "Sri Lanka",
    countryName: "Шри-Ланка",
    countryRegion: ['Ампара', 'Анурадхапура', 'Бадулла', 'Баттикалоа', 'Вавуния', 'Галле', 'Гампаха', 'Джафна', 'Калутара', 'Канди', 'Кегалле', 'Коломбо', 'Курунегала', 'Маннар', 'Матале', 'Матара', 'Монерагала', 'Нувара-Элия', 'Путталам', 'Ратнапура', 'Тринкомали', 'Хамбантота']
},
{
    countryEng: "Ecuador",
    countryName: "Эквадор",
    countryRegion: ['Азуай', 'Гуаяс', 'Имбабура', 'Котопахи', 'Лос-Риос', 'Лоха', 'Манаби', 'Пичинча', 'Санта-Елена', 'Санто-Доминго-де-лос-Ташилас', 'Тунгурауа', 'Чимборасо', 'Эль-Оро', 'Эсмеральдас']
},
{
    countryEng: "Equatorial Guinea",
    countryName: "Экваториальная Гвинея",
    countryRegion: ['Литораль', 'Северный Биоко', 'Ке-Нтем', 'Веле-Нзас', 'Сентро-Сур', 'Южный Биоко', 'Аннобон']
},
{
    countryEng: "Eritrea",
    countryName: "Эритрея",
    countryRegion: ['Маэкель', 'Ансэба', 'Гаш-Барка', 'Дэбуб', 'Сэмиэн-Кэй-Бахри', 'Дэбуб-Кэй-Бахри']
},
{
    countryEng: "Estonia",
    countryName: "Эстония",
    countryRegion: ['Валгамаа', 'Вильяндимаа', 'Вырумаа', 'Ида-Вирумаа', 'Йыгевамаа', 'Ляэне-Вирумаа', 'Ляэнемаа', 'Пылвамаа', 'Пярнумаа', 'Рапламаа', 'Сааремаа', 'Тартумаа', 'Харьюмаа', 'Хийумаа', 'Ярвамаа']
},
{
    countryEng: "Ethiopia",
    countryName: "Эфиопия",
    countryRegion: ['Амхара', 'Бенишангуль-Гумузский', 'Дыре Дава', 'Гамбела', 'Оромия', 'Южный регион наций', 'Сомалийская', 'Тыграй', 'Аддис-Абеба', 'Харари']
},
{
    countryEng: "South Africa",
    countryName: "ЮАР",
    countryRegion: ['Западный Кейп', 'Восточный Кейп', 'Гаутенг', 'Квазулу-Натал', 'Свободное государство', 'Северо-Запад', 'Лимпопо', 'Мпумаланга', 'Северный Кейп']
},
{
    countryEng: "South Korea",
    countryName: "Южная Корея",
    countryRegion: ['Город прямого подчинения', 'Канвондо', 'Кёнгидо', 'Кёнсан-Намдо', 'Кёнсан-Пукто', 'Чеджудо', 'Чолла-Намдо', 'Чолла-Пукто', 'Чхунчхон-Намдо']
},
{
    countryEng: "Jamaica",
    countryName: "Ямайка",
    countryRegion: ['Кингстон', 'Святой Екатерины', 'Сент-Джеймс', 'Кларендон', ' Сент-Энн', 'Вестморленд', 'Манчестерский приход', 'Портленд']
},
{
    countryEng: "Japan",
    countryName: "Япония",
    countryRegion: ['Хоккайдо', 'Тохоку', 'Канто', 'Тюбу', 'Хокурику', 'Косинъэцу', 'Синъэцу', 'Токай', 'Кансай', 'Тюгоку', 'Сикоку', 'Кюсю']
}
]



/////////////////////////////////////////////////////////////////////////////////////

let navbar_tab_button = document.querySelectorAll('button.navbar_tab_button')
navbar_tab_button.forEach(element => element.onclick = (e) => openDrop(e.target));

function openDrop(clickElement = document.querySelectorAll('.navbar_tab_button.F_A_B'), all = false) {
    if (all === false) {
        navbar_tab_button.forEach(element => element.classList.remove('active'));
        clickElement.classList.add('active');
        if (clickElement.hasAttribute('data-open-GS')) {
            document.querySelectorAll('[data-open-GS]:not(button)').forEach(contentElement => {
                if (contentElement.getAttribute('data-open-GS') == clickElement.getAttribute('data-open-GS')) contentElement.classList.remove('display-none');
                else contentElement.classList.add('display-none');
            });
        } else if (clickElement.hasAttribute('data-open-SS-4')) {
            document.querySelectorAll('[data-open-SS-4]:not(button)').forEach(contentElement => {
                if (contentElement.getAttribute('data-open-SS-4') == clickElement.getAttribute('data-open-SS-4')) contentElement.classList.remove('display-none');
                else contentElement.classList.add('display-none');
            });
        } else if (clickElement.hasAttribute('data-open-SS-5')) {
            document.querySelectorAll('[data-open-SS-5]:not(button)').forEach(contentElement => {
                if (contentElement.getAttribute('data-open-SS-5') == clickElement.getAttribute('data-open-SS-5')) contentElement.classList.remove('display-none');
                else contentElement.classList.add('display-none');
            });
        } else if (clickElement.hasAttribute('data-open-SS-17')) {
            document.querySelectorAll('[data-open-SS-17]:not(button)').forEach(contentElement => {
                if (contentElement.getAttribute('data-open-SS-17') == clickElement.getAttribute('data-open-SS-17')) contentElement.classList.remove('display-none');
                else contentElement.classList.add('display-none');
            });
        } else if (clickElement.hasAttribute('data-open-RG')) {
            document.querySelectorAll('[data-open-RG]:not(button)').forEach(contentElement => {
                if (contentElement.getAttribute('data-open-RG') == clickElement.getAttribute('data-open-RG')) contentElement.classList.remove('display-none');
                else contentElement.classList.add('display-none');
            });
        }
    } else if (all === true) {
        navbar_tab_button.forEach(element => element.classList.remove('active'));
        clickElement.forEach(element => element.classList.add('active'));
        let contentElements = document.querySelectorAll('[data-open-GS]:not(button), [data-open-SS-4]:not(button), [data-open-SS-5]:not(button), [data-open-SS-17]:not(button), [data-open-RG]:not(button)');
        let firstActiveContent = document.querySelectorAll('.F_A_C');
        contentElements.forEach(element => element.classList.add('display-none'));
        firstActiveContent.forEach(element => element.classList.remove('display-none'));
    }
}

let buttonBtn = document.querySelectorAll('button.btn[data-open-SS]');
buttonBtn.forEach(element => element.onclick = () => {
    buttonBtn.forEach(element => element.classList.remove('active'));
    element.classList.add('active');
    let clickElement = element;
    let contentSS = document.querySelectorAll('.content_SS[data-open-SS]');
    contentSS.forEach(element => {
        if (element.getAttribute('data-open-SS') === clickElement.getAttribute('data-open-SS')) element.classList.remove('display-none');
        else element.classList.add('display-none');
    });
    openDrop(undefined, true);
});


let infoComponent = document.querySelectorAll('.infoComponent');
infoComponent.forEach(element => {
    let select = element.previousElementSibling.querySelector('select');
    let selVal = select.value;
    if (element.getAttribute('data-text-' + selVal)) element.innerText = element.getAttribute('data-text-' + selVal);
    else element.innerText = '';
    if (select.hasAttribute('data-open-content') && select.getAttribute('data-open-content') === selVal) {
        element.closest('.col-12').querySelector('.open_content').classList.remove('display-none');
    }
});

function changeSelect(select) {
    let infoComponent = select.closest('.col-8').querySelector('.infoComponent');
    let selVal = select.value;
    if (infoComponent && infoComponent.getAttribute('data-text-' + selVal)) infoComponent.innerText = infoComponent.getAttribute('data-text-' + selVal);
    else if (infoComponent) infoComponent.innerText = '';
    if (select.hasAttribute('data-open-content') && select.getAttribute('data-open-content') === selVal) {
        select.closest('.col-12').querySelector('.open_content').classList.remove('display-none');
    } else if (select.hasAttribute('data-open-content') && select.getAttribute('data-open-content') !== selVal) {
        select.closest('.col-12').querySelector('.open_content').classList.add('display-none');
    }
}

////////////////////////////////////////////////////////////////////////////

let block_counters_and_code = document.querySelector('.block_counters_and_code');
let add_block_counters_and_code = document.querySelector('.add_block_counters_and_code');
let edit_block_counters_and_code = document.querySelector('.edit_block_counters_and_code');

let CAC_header_add_btn = document.querySelector('.block_counters_and_code .CAC_header_add_btn');
CAC_header_add_btn.onclick = (e) => {
    block_counters_and_code.classList.add('display-none');
    add_block_counters_and_code.classList.remove('display-none');
}

let btnCancel_add_block_CAC = document.querySelector('.add_block_counters_and_code .btn.cancel');

function F_btnCancel_add_block_CAC() {
    add_block_counters_and_code.classList.add('display-none');
    block_counters_and_code.classList.remove('display-none');
}
btnCancel_add_block_CAC.onclick = () => F_btnCancel_add_block_CAC();

let action_edit_block_CAC = document.querySelectorAll('.block_counters_and_code .actionBtn.action_edit');
action_edit_block_CAC.forEach(element => element.onclick = () => {
    block_counters_and_code.classList.add('display-none');
    edit_block_counters_and_code.classList.remove('display-none');
});

let btnCancel_edit_block_CAC = document.querySelector('.edit_block_counters_and_code .btn.cancel');

function F_btnCancel_edit_block_CAC() {
    edit_block_counters_and_code.classList.add('display-none');
    block_counters_and_code.classList.remove('display-none');
}
btnCancel_edit_block_CAC.onclick = () => F_btnCancel_edit_block_CAC();

////////////////////////////////////////////////////////////////////////////

let block_currencies_list = document.querySelector('.block_currencies_list');
let add_block_currencies_list = document.querySelector('.add_block_currencies_list');
let edit_block_currencies_list = document.querySelector('.edit_block_currencies_list');

let CL_header_add_btn = document.querySelector('.block_currencies_list .CL_header_add_btn');
CL_header_add_btn.onclick = (e) => {
    block_currencies_list.classList.add('display-none');
    add_block_currencies_list.classList.remove('display-none');
}

let btnCancel_add_block_CL = document.querySelector('.add_block_currencies_list .btn.cancel');

function F_btnCancel_add_block_CL() {
    add_block_currencies_list.classList.add('display-none');
    block_currencies_list.classList.remove('display-none');
}
btnCancel_add_block_CL.onclick = () => F_btnCancel_add_block_CL();

let action_edit_block_CL = document.querySelectorAll('.block_currencies_list .actionBtn.action_edit');
action_edit_block_CL.forEach(element => element.onclick = () => {
    block_currencies_list.classList.add('display-none');
    edit_block_currencies_list.classList.remove('display-none');
});

let btnCancel_edit_block_CL = document.querySelector('.edit_block_currencies_list .btn.cancel');

function F_btnCancel_edit_block_CL() {
    edit_block_currencies_list.classList.add('display-none');
    block_currencies_list.classList.remove('display-none');
}
btnCancel_edit_block_CL.onclick = () => F_btnCancel_edit_block_CL();

////////////////////////////////////////////////////////////////////////////

let RG_items_country = document.querySelector('.block_regions_countries .content_RG[data-open-RG="1"] .RG_items');
let html_RG_items_country = '';

function F_html_RG_items_country(props) {
    return (
        `
        <div class="RG_item">
        <div class="id">${props.id}</div>
        <div class="name">${props.countryName}</div>
        <div class="keyword">${props.countryKeyword}</div>
        <div class="actions">
        <div class="actionBtn action_editCat" key="${props.countryKeyword}"><img src="icons/editCat.svg"></div>
        <div class="actionBtn action_power" key="${props.countryKeyword}"><img src="icons/power.svg"></div>
        <div class="actionBtn action_edit" key="${props.countryKeyword}"><img src="icons/edit.svg"></div>
        </div>
        </div>
        `
        )
}
countries.forEach((country, index) => html_RG_items_country += F_html_RG_items_country({
    id: index,
    countryName: country.countryName,
    countryKeyword: country.countryEng
}));
RG_items_country.innerHTML = html_RG_items_country;

let add_btn_country = document.querySelector('.content_RG[data-open-RG="1"] .add_btn_country');
add_btn_country.onclick = () => {
    document.querySelector('.add_block_regions_countries_1').classList.remove('display-none');
}

let btnCancel_add_block_RG_1 = document.querySelectorAll('.add_block_regions_countries_1 .btn_exit, .add_block_regions_countries_1 .btn_cancel');
btnCancel_add_block_RG_1.forEach(element => element.onclick = () => {
    document.querySelector('.add_block_regions_countries_1').classList.add('display-none');
});

let action_editCat_rg_1 = document.querySelectorAll('.content_RG[data-open-RG="1"] .action_editCat');
action_editCat_rg_1.forEach(element => element.onclick = () =>{
    openDrop(document.querySelector('.navbar_tab_button[data-open-RG="2"]'));
    draw_region(element.getAttribute('key')); 
    document.documentElement.scrollTo({
        top: 0,
        behavior: 'smooth'
    });
});

let action_edit_rg_1 = document.querySelectorAll('.content_RG[data-open-RG="1"] .action_edit');
action_edit_rg_1.forEach(element => element.onclick = () => {
    document.querySelector('.edit_block_regions_countries_1').classList.remove('display-none');
});

let btnCancel_edit_block_RG_1 = document.querySelectorAll('.edit_block_regions_countries_1 .btn_exit, .edit_block_regions_countries_1 .btn_cancel');
btnCancel_edit_block_RG_1.forEach(element => element.onclick = () => {
    document.querySelector('.edit_block_regions_countries_1').classList.add('display-none');
});

//////////////////////////////////////////
let RG_country_2 = document.querySelector('#RG_country_2');
let RG_country_2_edit = document.querySelector('#RG_country_2_edit');
let html_options_select_country = countries.map(country => `<option value="${country.countryEng}">${country.countryName}</option>`);
RG_country_2.innerHTML = html_options_select_country;
RG_country_2_edit.innerHTML = html_options_select_country;

function draw_region(keywordCountry = 'Uzbekistan') {

    function find_objCountry_for_region(keywordCountry) {
        let nameCountry;
        countries.forEach(country => {
            if (country.countryEng === keywordCountry)  nameCountry = country;
        });
        return nameCountry;
    }

    function F_html_RG_items_region(props) {
        return (
            `
            <div class="RG_item">
            <div class="id">${props.id}</div>
            <div class="name">${props.nameRegion}</div>
            <div class="keyword"></div>
            <div class="actions">
            <div class="actionBtn action_power" key="${props.nameCountry + '_' + props.nameRegion}"><img src="icons/power.svg"></div>
            <div class="actionBtn action_choosen" key="${props.nameCountry + '_' + props.nameRegion}"><img src="icons/choosen.svg"></div>
            <div class="actionBtn action_edit" key="${props.nameCountry + '_' + props.nameRegion}"><img src="icons/edit.svg"></div>
            </div>
            </div>
            `
            )
    }

    let RG_items_region = document.querySelector('.block_regions_countries .content_RG[data-open-RG="2"] .RG_items');
    let html_RG_items_region = '';
    let country = find_objCountry_for_region(keywordCountry);

    country.countryRegion.forEach((region, index) => html_RG_items_region += F_html_RG_items_region({
        id: index,
        nameRegion: region,
        nameCountry: country.countryEng
    }));
    RG_items_region.innerHTML = html_RG_items_region;

    RG_country_2.value = keywordCountry;
    F_action_edit_rg_2();
}
draw_region();

RG_country_2.onchange = (event) => {
    draw_region(event.target.value);
}

let add_btn_region = document.querySelector('.content_RG[data-open-RG="2"] .add_btn_region');
add_btn_region.onclick = () => {
    document.querySelector('.add_block_regions_countries_2').classList.remove('display-none');
}

let btnCancel_add_block_RG_2 = document.querySelectorAll('.add_block_regions_countries_2 .btn_exit, .add_block_regions_countries_2 .btn_cancel');
btnCancel_add_block_RG_2.forEach(element => element.onclick = () => {
    document.querySelector('.add_block_regions_countries_2').classList.add('display-none');
});

function F_action_edit_rg_2() {
    let action_edit_rg_2 = document.querySelectorAll('.content_RG[data-open-RG="2"] .action_edit');
    action_edit_rg_2.forEach(element => element.onclick = () => {
        document.querySelector('.edit_block_regions_countries_2').classList.remove('display-none');
    });
}
F_action_edit_rg_2();

let btnCancel_edit_block_RG_2 = document.querySelectorAll('.edit_block_regions_countries_2 .btn_exit, .edit_block_regions_countries_2 .btn_cancel');
btnCancel_edit_block_RG_2.forEach(element => element.onclick = () => {
    document.querySelector('.edit_block_regions_countries_2').classList.add('display-none');
});

///////////////////////////////////////////////////////////////////////////////////

let interrogation = document.querySelectorAll('div.interrogation');

interrogation.forEach(element => element.onmouseenter = (event) => {
    let info_interrogation = document.querySelector('.info_interrogation');
    info_interrogation.innerHTML = event.target.getAttribute('data-title');
    info_interrogation.style.top = (event.clientY) + 'px';
    info_interrogation.style.left = (event.clientX + 30) + 'px';
    info_interrogation.classList.remove('display-none');
});

interrogation.forEach(element => element.onmouseleave = (event) => {
    let info_interrogation = document.querySelector('.info_interrogation');
    info_interrogation.classList.add('display-none');
});

/* ======================== extra ===========================  */
let chat = document.querySelector('.chat i');
let chatText = document.querySelector('.chat_text');
const showChat = document.querySelector('.block');


showChat.addEventListener('click', () => {
    chatText.style.visibility = 'hidden';
});

let click;
chat.addEventListener('click', () => {
    if (click == 0) {
        chatText.style.visibility = 'hidden'
        return click = 1;
    } else {
        chatText.style.visibility = 'visible'
        return click = 0;
    }
});



$(function () { 
    let menu_list = document.querySelectorAll('.menu_list');
    for (let i = 0; i < menu_list.length; i++) {
        menu_list[i].addEventListener('click', function (e) {
            let submenu = menu_list[i].parentElement.children[1];
            let arrow = menu_list[i].children[0];
            $(submenu).slideToggle(300);
            $(arrow).eq($(this).index()).toggleClass('upactive');
        })
    }
    let quit = document.querySelector('.quitBlock');
    let avatar = document.querySelector('.avatar');

    avatar.addEventListener('click', () => {
        quit.style.display = 'block';
        if (quit.style.right == '69px') {
            $(quit).animate({ right: "7px" }, 500);
        } else {
            $(quit).animate({ right: "69px" }, 500);
        }
    })
    showChat.addEventListener('click', () => {
        $(quit).animate({ right: "7px" }, 500);
    });

})

/* =========================== переключатели ========================== */

const toggler = (target, showingTarget, hidingTargetOne, hidingTargetTwo, hidingTargetThree, hidingTargetFour, hidingTargetFive) => {
    target.addEventListener('click', () => {
        showingTarget.style.display = 'block';
        hidingTargetTwo.style.display = 'none';
        hidingTargetOne.style.display = 'none';
        hidingTargetFour.style.display = 'none';
        hidingTargetThree.style.display = 'none';
        hidingTargetFive.style.display = 'none';
    })
}

let activeToggles = document.querySelectorAll('.activeToggles');
let targetOne = document.querySelector('.general_settings');
let targetTwo = document.querySelector('.system_settings');
let targetThree = document.querySelector('.counters_and_code');
let targetFour = document.querySelector('.currencies_list');
let targetFive = document.querySelector('.regions_countries');
let targetSix = document.querySelector('.system_state');
for(let i = 0;i < activeToggles.length; i++){
    activeToggles[i].addEventListener('click', () => {
        if(activeToggles[0].classList.contains('mainActive')){
            activeToggles[0].classList.remove('mainActive');
        }else if(activeToggles[1].classList.contains('mainActive')){            
            activeToggles[1].classList.remove('mainActive');
        }else if(activeToggles[2].classList.contains('mainActive')){            
            activeToggles[2].classList.remove('mainActive');
        }else if(activeToggles[3].classList.contains('mainActive')){            
            activeToggles[3].classList.remove('mainActive');
        }else if(activeToggles[4].classList.contains('mainActive')){            
            activeToggles[4].classList.remove('mainActive');
        }else{            
            activeToggles[5].classList.remove('mainActive');            
        }
        activeToggles[i].classList.add('mainActive');
    })    
}
toggler(activeToggles[0], targetOne, targetTwo, targetThree, targetFour, targetFive, targetSix)
toggler(activeToggles[1], targetTwo, targetOne, targetThree, targetFour, targetFive, targetSix)
toggler(activeToggles[2], targetThree, targetOne, targetTwo, targetFour, targetFive, targetSix)
toggler(activeToggles[3], targetFour, targetOne, targetThree, targetTwo, targetFive, targetSix)
toggler(activeToggles[4], targetFive, targetOne, targetThree, targetFour, targetTwo, targetSix)
toggler(activeToggles[5], targetSix, targetOne, targetThree, targetFour, targetFive, targetTwo)
